local function run (msg ,matches)
if matches[1]:lower () == 'doa list' and is_mod(msg) or matches[1] == 'لیست دعا' and is_mod(msg) then
local AXE = "زیارت عاشورا\nدعای توسل\nدعای کمیل\nدعای عهد\nدعای ندبه\nدعای سمات\nجهت دریافت متن هر دعا، کافیست نام دعا را ارسال کنید\n🌹AxE🦋"
return [[
🦋🌹 زیارت عاشورا
🦋🌹 دعای توسل
🦋🌹 دعای کمیل
🦋🌹 دعای عهد
🦋🌹 دعای ندبه
🦋🌹 دعای فرج
🦋🌹 دعای سمات
🦋🌹 آیت الکرسی
جهت دریافت متن هر دعا، کافیست نام دعا را ارسال کنید
🌹AxE🦋
]]
end
if matches[1]:lower()=='عاشورا'and is_mod(msg)or matches[1]=='زیارت عاشورا'and is_mod(msg)then
local ashoora1 = [[
💠🍃 زیارت عاشورا 🍃💠

☀️بسْمِ اللهِ الرَّحْمنِ الرَّحِیمِ

🌇 السَّلامُ عَلَیْکَ یا اَباعَبْدِاللهِ ، اَلسَّلامُ عَلَیْکَ یَابْنَ رَسُولِ اللهِ ، اَلسَّلاٰمُ عَلَیْکَ یَا بْنَ اَمیرِالْمُؤْمِنین ، وَ ابْنَ سَیِّدِ الْوَصِیّینَ اَلسَّلامُ عَلَیْکَ یَا بْنَ فاطِمَهَ سَیِّدَهِ نِسٰاءِ الْعٰالَمینَ ، اَلسَّلامُ عَلَیْکَ یا ثارَاللهِ و َابْنَ ثارِەِ ، و َالْوِتْرَ الْمَوْتُورَ، اَلسَّلامُ عَلَیْکَ و َعَلَى الْاَرْواحِ الَّتى حَلَّتْ بِفِنٰائِکَ ، عَلَیْکُمْ مِنّى جَمیعاً سَلاٰمُ اللهِ اَبَداً مٰا بَقیتُ و َبَقِىَ اللَّیْلُ وَ النَّهارُ

🏕 یا اَباعَبْدِاللهِ لَقَدْ عَظُمَتِ الرَّزِیَّهُ وَ جَلَّتْ وَ عَظُمَتِ الْمُصیبَهُ بِکَ عَلَیْنا وَ عَلىٰ جَمیعِ اَهْل ِالْاِسْلامِ وَ جَلَّتْ و َعَظُمَتْ مُصیبَتُکَ فِى السَّمٰوٰاتِ عَلىٰ جَمیعِ اَهْلِ السَّمٰوٰات ِ، فَلَعَنَ اللهُ اُمَّهً اَسَّسَتْ اَسٰاسَ الظُّلْمِ وَ الْجَوْرِ عَلَیْکُمْ اَهْلَ الْبَیْت ِ، و َلَعَنَ اللهُ اُمَّهً دَفَعَتْکُمْ عَنْ مَقامِکُمْ ، وَ اَزالَتْکُمْ عَنْ مَراتِبِکُمُ الَّتى رَتَّبَکُمُ اللهُ فیهٰا ، و َلَعَنَ اللهُ اُمَّهً قَتَلَتْکُمْ ، وَ لَعَنَ اللهُ الْمُمَهِّدینَ لَهُمْ بِالتَّمْکینِ مِنْ قِتالِکُم 

🌇برِئْتُ اِلَى اللهِ وَ اِلَیْکُمْ مِنْهُمْ ، وَ مِنْ اَشْیاعِهِمْ وَ اَتْباعِهِمْ وَ اَوْلِیٰائِهِمْ ، یا اَبا عَبْدِاللهِ اِنّى سِلْمٌ لِمَنْ سالَمَکُمْ وَ حَرْبٌ لِمَنْ حارَبَکُمْ اِلى یَوْمِ الْقِیامَه ِ، وَ لَعَنَ اللهُ آلَ زِیادٍ و َآلَ مَرْوانَ وَ لَعَنَ اللهُ بَنى اُمَیَّهَ قاطِبَهً وَ لَعَنَ اللهُ ابْنَ مَرْجٰانَهَ ، وَ لَعَنَ اللهُ عُمَرَ بْنَ سَعْدٍ وَ لَعَنَ اللهُ شِمْراً ، وَ لَعَنَ اللهُ اُمَّهً اَسْرَجَتْ وَ اَلْجَمَتْ و َتَنَقَّبَتْ لِقِتالِکَ ، 

🏕 باَبى اَنْتَ و َاُمّى ، لَقَدْ عَظُمَ مُصٰابى بِکَ ، فَاَسْئَلُ اللهَ الَّذى اَکْرَمَ مَقامَکَ ، وَاَکْرَمَنى بِکَ اَنْ یَرْزُقَنى طَلَبَ ثارِکَ مَعَ اِمامٍ مَنْصُورٍ مِنْ اَهْلِ بَیْتِ مُحَمَّدٍ صَلَّى اللهُ عَلَیْهِ وَ آلِهِ ، اَللّٰهُمَّ ٱجْعَلْنى عِنْدَکَ وَجیهاً بِالْحُسَیْنِ عَلَیْهِ السَّلامُ فِى الدُّنْیا وَ الاْخِرَهِ ، یا اَبا عَبْدِاللهِ اِنّى اَتَقَرَّبُ اِلى اللهِ وَ اِلىٰ رَسُولِهِ ، وَاِلىٰ امیرِالْمُؤْمِنینَ وَ اِلىٰ فاطِمَهَ ، وَاِلَى الْحَسَنِ وَ اِلَیْکَ بِمُوالاتِکَ ، وَبِالْبَرائَهِ مِمَّنْ قاتَلَکَ وَ نَصَبَ لَکَ الْحَرْبَ ، وَ بِالْبَرائَهِ مِمَّنْ اَسَّسَ اَسٰاسَ الظُّلْمِ وَ الْجَوْرِعَلَیْکُمْ وَ اَبْرَءُ اِلَى اللّهِ وَ اِلى رَسُولِهِ ،مِمَّنْ اَسَسَّ اَسٰاسَ ذٰلِکَ وَبَنىٰ عَلَیْهِ بُنْیانَهُ وَجَرىٰ فى ظُلْمِهِ وَجَوْرِہِ عَلَیْکُمْ وَعَلىٰ اَشْیٰاعِکُمْ

🌇 برِئْتُ اِلَى اللَّهِ وَ اِلَیْکُمْ مِنْهُمْ وَ اَتَقَرَّبُ اِلَى اللهِ ثُمَّ اِلَیْکُمْ بِمُوٰالاتِکُمْ وَ مُوالاهِ وَلِیِّکُمْ وَ بِالْبَرائَهِ مِنْ اَعْدائِکُمْ وَ النّاصِبینَ لَکُمُ الْحَرْبَ وَ بِالْبَرائَهِ مِنْ اَشْیاعِهِمْ و َاَتْباعِهِمْ ، اِنّى سِلْمٌ لِمَنْ سالَمَکُمْ وَ حَرْبٌ لِمَنْ حارَبَکُمْ وَ وَلِىٌّ لِمَنْ والاکُمْ و َعَدُوٌّ لِمَنْ عادٰاکُمْ ، فَاَسْئَلُ اللهَ الَّذى اَکْرَمَنى بِمَعْرِفَتِکُمْ وَ مَعْرِفَهِ اَوْلِیٰائِکُمْ ، و َرَزَقَنِى الْبَرائَهَ مِنْ اَعْدائِکُمْ ، اَنْ یَجْعَلَنى مَعَکُمْ فِى الدُّنْیا وَ الْاٰخِرَهِ 
]]
local ashoora2 = [[
🌇 و َاَنْ یُثَبِّتَ لى عِنْدَکُمْ قَدَمَ صِدْقٍ فِى الدُّنْیا وَ الاْخِرَهِ وَ اَسْئَلُهُ اَنْ یُبَلِّغَنِى الْمَقامَ الْمَحْمُودَ لَکُمْ عِنْدَ اللَّهِ، وَ اَنْ یَرْزُقَنى طَلَبَ ثاریکُم مَعَ اِمامٍ مَهْدیٍ هُدىً ظاهِرٍ ناطِقٍ بِالْحَقِّ مِنْکُمْ ، وَ اَسْئَلُ اللهَ بِحَقِّکُمْ و َبِالشَّاْنِ الَّذى لَکُمْ عِنْدَەُ اَنْ یُعْطِیَنى بِمُصابى بِکُمْ ، اَفْضَلَ ما یُعْطى مُصاباً بِمُصیبَتِهِ، مُصیبَهً مٰا اَعْظَمَهٰا و َاَعْظَمَ رَزِیَّتَها فِى الْاِسْلامِ و َفى جَمیعِ السَّمٰوٰاتِ و َالْاَرْض ِ، 

🏕اللّهُمَّ اجْعَلْنى فى مَقامى هٰذا مِمَّنْ تَنالُهُ مِنْکَ صَلَواتٌ و َرَحْمَهٌ وَ مَغْفِرَهٌ اَللّهُمَّ اجْعَلْ مَحْیٰاىَ مَحْیٰا مُحَمَّدٍ وَآلِ مُحَمَّدٍ ، وَ مَمٰاتى مَمٰاتَ مُحَمَّدٍ وَآلِ مُحَمَّدٍ، اَللّهُمَّ اِنَّ هٰذا یَوْمٌ تَبَرَّکَتْ بِهِ بَنُو اُمَیَّهَ وَابْنُ آکِلَهِ الْاَکْبٰادِ اللَّعینُ ابْنُ اللَّعینِ ، عَلىٰ لِسٰانِکَ وَ لِسانِ نَبِیِّکَ صَلَّى اللهُ عَلَیْهِ وَآلِهِ، فى کُلِّ مَوْطِنٍ وَمَوْقِفٍ وَقَفَ فیهِ نَبِیُّکَ صَلَّى اللهُ عَلَیْهِ و َآلِهِ ، اَللّهُمَّ الْعَنْ اَبا سُفْیانَ و َمُعٰوِیَهَ ، وَ یَزیدَ بْنَ مُعاوِیَهَ ، عَلَیْهِمْ مِنْکَ اللَّعْنَهُ اَبَدَ الاْبِدینَ، 

🌇و هٰذا یَوْمٌ فَرِحَتْ بِهِ آلُ زیٰادٍ و َآلُ مَرْوانَ ، بِقَتْلِهِمُ الْحُسَیْنَ صَلَواتُ اللهِ عَلَیْهِ،اَللّٰهُمَّ فَضاعِفْ عَلَیْهِمُ اللَّعْنَ مِنْکَ وَالْعَذابَ [الاَْلیمَ] ، اَللّٰهُمَّ اِنّى اَتَقَرَّبُ اِلَیْکَ فى هٰذَالْیَوْمِ وَفى مَوْقِفى هٰذا وَ اَیّامِ حَیٰوتى بِالْبَراَّئَهِ مِنْهُمْ وَاللَّعْنَهِ عَلَیْهِمْ ، وَبِالْمُوالاتِ لِنَبِیِّکَ وَآلِ نَبِیِّکَ عَلَیْهِ وَ عَلَیْهِمُ اَلسَّلامُ 

💠صد مرتبه : 

🏕 اللّهُمَّ الْعَنْ اَوَّلَ ظالِمٍ ظَلَمَ حَقَّ مُحَمَّدٍ و َآلِ مُحَمَّدٍ، وَآخِرَ تابِعٍ لَهُ عَلى ذلِکَ ، اَللّهُمَّ الْعَنِ الْعِصابَهَ الَّتى جاهَدَتِ الْحُسَیْنَ ، وَشٰایَعَتْ وَبٰایَعَتْ وَتٰابَعَتْ عَلىٰ قَتْلِهِ ، اَللّٰهُمَّ الْعَنْهُمْ جَمیعاً 

💠 صد مرتبه : 

🌇 السَّلٰامُ عَلَیْکَ یٰا اَبٰا عَبْدِ اللهِ ، وَعَلَى الْاَرْوٰاحِ الَّتى حَلَّتْ بِفِنٰائِکَ ، عَلَیْکَ مِنّى سَلامُ اللهِ اَبَداً ما بَقیتُ وَبَقِىَ اللَّیْلُ وَ النَّهٰارُ ، وَلا جَعَلَهُ اللهُ آخِرَ الْعَهْدِ مِنّى لِزِیٰارَتِکُمْ ، اَلسَّلامُ عَلَى الْحُسَیْنِ  و َعَلٰى عَلِىِّ بْنِ الْحُسَیْنِ ، و َعَلىٰ اَوْلادِ الْحُسَیْنِ ، وَ عَلىٰ اَصْحٰابِ الْحُسَیْن 

🏕 اللّٰهُمَّ خُصَّ اَنْتَ اَوَّلَ ظالِمٍ بِاللَّعْنِ مِنّى و َابْدَاءْ بِهِ اَوَّلاً ، ثُمَّ الثّانِىَ و َالثّالِثَ و َالرّابِعَ اَللّهُمَّ الْعَنْ یَزیدَ خامِساً ، وَالْعَنْ عُبَیْدَ اللهِ بْنَ زِیٰادٍ وَابْنَ مَرْجٰانَهَ وَعُمَرَ بْنَ سَعْدٍ وَشِمْراً وَآلَ اَبى سُفْیانَ وَآلَ زِیادٍ وَآلَ مَرْوانَ اِلى یَوْمِ الْقِیمَهِ 

💠 ذکر سجده : 

🌇 اللّهُمَّ لَکَ الْحَمْدُ حَمْدَ الشّاکِرینَ لَکَ عَلٰى مُصابِهِمْ ، اَلْحَمْدُ لِلّٰهِ عَلٰى عَظیمِ رَزِیَّتى ، اَللّهُمَّ ارْزُقْنى شَفاعَهَ الْحُسَیْنِ یَوْمَ الْوُرُودِ ، وَثَبِّتْ لى قَدَمَ صِدْقٍ عِنْدَکَ مَعَ الْحُسَیْنِ وَاَصْحابِ الْحُسَیْن ،ِ الَّذینَ بَذَلُوا مُهَجَهُمْ دُونَ الْحُسَیْنِ عَلَیْهِ السَّلامُ.  

 التماس دعا 🌹AxE🦋
 ]]
return tdbot.sendMessage(msg.to.id,0,1, ashoora1,1,'html') ,
tdbot.sendMessage(msg.to.id,0,1, ashoora2,1,'html')
end
if matches[1] == 'آیت الکرسی' and is_mod(msg) or matches[1] == 'ایت الکرسی' and is_mod(msg) then
return [[
بسم الله الرحمن الرحیم

اللّهُ لاَ إِلَهَ إِلاَّ هُوَ الْحَیُّ الْقَیُّومُ لاَ تَأْخُذُهُ سِنَهٌ وَلاَ نَوْمٌ لَّهُ مَا فِی السَّمَاوَاتِ وَمَا فِی الأَرْضِ

مَن ذَا الَّذِی یَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ یَعْلَمُ مَا بَیْنَ أَیْدِیهِمْ وَمَا خَلْفَهُمْ وَلاَ یُحِیطُونَ بِشَیْءٍ

مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ کُرْسِیُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ یَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِیُّ الْعَظِیمُ

لاَ إِکْرَاهَ فِی الدِّینِ قَد تَّبَیَّنَ الرُّشْدُ مِنَ الْغَیِّ فَمَنْ یَکْفُرْ بِالطَّاغُوتِ وَیُؤْمِن بِاللّهِ

فَقَدِ اسْتَمْسَکَ بِالْعُرْوَهِ الْوُثْقَىَ لاَ انفِصَامَ لَهَا وَاللّهُ سَمِیعٌ عَلِیمٌ

اللّهُ وَلِیُّ الَّذِینَ آمَنُواْ یُخْرِجُهُم مِّنَ الظُّلُمَاتِ إِلَى النُّوُرِ وَالَّذِینَ کَفَرُواْ

أَوْلِیَآؤُهُمُ الطَّاغُوتُ یُخْرِجُونَهُم مِّنَ النُّورِ إِلَى الظُّلُمَاتِ أُوْلَئِکَ أَصْحَابُ النَّارِ هُمْ فِیهَا خَالِدُونَ

التماس دعا 🌹AxE🦋
]]
end
if matches[1] == 'دعای توسل' and is_mod(msg) or matches[1] == 'توسل' and is_mod(msg) then
local tavassol1 = [[
🌺 دعای توسل :
بِسمِ الله رحمن الرحیم
اَللّهُمَّ اِنّی اَسئلُکَ وَاَتَوَجَّهُ الَیکَ بِنَبِیِّکَ نَبِیّ الرَّحمَةِ مُحَمَّدٍ صَلَّی اللِّ یا اِمامَ الرَّحمَةِ یا سَیِدَناوَ مَولانا اِنا تَوَجَّهنا وَستَشفَعنا وَ تَوَسَّلنا بِکَ اِلیَ ا یا وَجیهاً عِندَاللّهِ اِشفَع لَنا عِندَاللّه یا آبَاالحَسَنِ یا اَمیرَالمُؤمِنینَ یا عَلیَّ بنَی خَلقِهِ یا سَیِدَناوَ مَولانا اِنا تَوَجَّهنا وَستَشفَعنا وَ تَوَسَّلنا بِکَ اِلیَ اللّهِ وَ قَهاً عِندَاللّهِ اِشفَع لَنا عِندَاللّه یا فاطِمَةُ الزَّهراءِ یابِنتَ مُحَمَّدٍ یا قُرَّ ةَ عَین اِنا تَوَجَّهنا وَستَشفَعنا وَ تَوَسَّلنا بِکِ اِلیَ اللّهِ وَ قَدَّمناکِ بَینَ یَدَی حاجاتِنا یادَاللّه یااَبا مُحَمَّدٍ یاحَسَنَ بنِ عَلِیِ اَیُّهَا المُجتَبی یَابنَ رَسوُلِ اللّهِ یا حُجَّةَ  اِنا تَوَجَّهنا وَستَشفَعنا وَ تَوَسَّلنا بِکَ اِلیَ اللّهِ وَ قَدَّمناکَ بَینَ یَدَی حاجاتِنا یاَاللّه یااَباعَبدِاللّهِ یا حُسَینَ بنَ عَلِیٍّ اَیُّهَا الشَّهیدُیَابنَ رَسوُلِ اللّهِ یا حُجّانا اِنا تَوَجَّهنا وَستَشفَعنا وَ تَوَسَّلنا بِکَ اِلیَ اللّهِ وَ قَدَّمناکَ بَینَ یَدَی حاجاتِناعِندَاللّه یا اَبَاالحَسَنِ یاعَلِیَّ بنَ الحُسَینِ یازَینَ العابِدینَ یَابنَ رَسوُلِ اللّهِ یا حَُ مَولانا اِنا تَوَجَّهنا وَستَشفَعنا وَ تَوَسَّلنا بِکَ اِلیَ اللّهِ وَ قَدَّمناکَ بَینَ یَدَی حالَنا عِندَاللّه یااَبا جَعفَرٍ یامُحَمَّدَ بنَ عَلِیٍّ اَیُّهَا الباقِرُ یَابنَ رَسوُلِ اللّهِ یامَولانا اِنا تَوَجَّهنا وَستَشفَعنا وَ تَوَسَّلنا بِکَ اِلیَ اللّهِ وَ قَدَّمناکَ بَینَ یَدَی حاجاَنا عِندَاللّه یا اَبا عَبدِاللّهِ یا جَعفَرَبنَ مُحَمَّدٍ اَیُّهَا الصّادِق یَابنَ رَسوُلِ اللّهِدَناوَ مَولانا اِنا تَوَجَّهنا وَستَشفَعنا وَ تَوَسَّلنا بِکَ اِلیَ اللّهِ وَ قَدَّمناکَ بَینَ یَِشفَع لَنا عِندَاللّه یا اَبَاالحَسَنِ یا موُسَی بنَ جَعفَرٍ اَیُّهَا الکاظِمُ یَابنَ رَسوُلِ اللّیا سَیِدَناوَ مَولانا اِنا تَوَجَّهنا وَستَشفَعنا وَ تَوَسَّلنا بِکَ اِلیَ اللّهِ و قَدَّمناکَ بَینَ یَدَی حاجاتِنا یا وَجیهاً عِندَاللّهِ اِشفَع لَنا عِندَاللّه]]
local tavassol2 = [[
یااَبَالحَسَنِ یا عَلِیَّ بنَ موُسَی الرِضا یَابنَ رَسوُلِ اللّهِ یا حُجَّةَ اللّهِ عَلی خَلقِهِ یا سَیِدَناوَ مَولانا اِنا تَوَجَّهنا وَستَشفَعنا وَ تَوَسَّلنا بِکَ اِلیَ اللّهِ وَ قَدَّمناکَ بَینَ یَدَی حاجاتِنا یا وَجیهاً عِندَاللّهِ اِشفَع لَنا عِندَاللّه یا اَبا جَعفَرٍ یا مُحَمَّدَبنَ عَلیٍّ اَیُّهَا التَّقِیُّ الجَوادُ یَابنَ رَسوُلِ اللّهِ یا حُجَّةَ اللّهِ عَلی خَلقِهِ یا سَیِدَناوَ مَولانا اِنا تَوَجَّهنا وَستَشفَعنا وَ تَوَسَّلنا بِکَ اِلیَ اللّهِ وَ قَدَّمناکَ بَینَ یَدَی حاجاتِنا یا وَجیهاً عِندَاللّهِ اِشفَع لَنا عِندَاللّه یا اَبا الحَسَنِ یا عَلِیَّ بنَ مُحَمَّدٍ اَیُّهَا الهادیِ النِّقِیُّ یَابنَ رَسوُلِ اللّهِ یا حُجَّةَ اللّهِ عَلی خَلقِهِ یا سَیِدَناوَ مَولانا اِنا تَوَجَّهنا وَستَشفَعنا وَ تَوَسَّلنا بِکَ اِلیَ اللّهِ وَ قَدَّمناکَ بَینَ یَدَی حاجاتِنا یا وَجیهاً عِندَاللّهِ اِشفَع لَنا عِندَاللّه یا اَبامُحَمَّدٍ یا حَسَنَ بنَ عَلِیٍ اَیُّهَا الزَّکِیُّ العَسکَرِیُّ یَابنَ رَسوُلِ اللّهِ یا حُجَّةَ اللّهِ عَلی خَلقِهِ یا سَیِدَناوَ مَولانا اِنا تَوَجَّهنا وَستَشفَعنا وَ تَوَسَّلنا بِکَ اِلیَ اللّهِ وَ قَدَّمناکَ بَینَ یَدَی حاجاتِنا یا وَجیهاً عِندَاللّهِ اِشفَع لَنا عِندَاللّه یا وَصِیَّ الحَسَنِ وَ الخَلَفَ الحُجَّةَ اَیُّهَا القائِمُ المُنتَظَرُ المَهدِیُّ یَابنَ رَسوُلِ اللّهِ یا حُجَّةَ اللّهِ عَلی خَلقِهِ یا سَیِدَناوَ مَولانا اِنا تَوَجَّهنا وَستَشفَعنا وَ تَوَسَّلنا بِکَ اِلیَ اللّهِ وَ قَدَّمناکَ بَینَ یَدَی حاجاتِنا یا وَجیهاً عِندَاللّهِ اِشفَع لَنا عِندَاللّه حال از خدا هرچه میخواهی طلب کن و اگر به دعایی که خواندی ایمان قلبی داشته باشی یقین داشته باش که دعایت اجابت میشود و سپس ادامه بده یا سادَتی وَ مَوالِیَّ اِنی تَوَجَّهتُ بِکُم اَئِمَّتی وَ عُدَّتی لِیَومِ فَقری وَ حاجَتی اِلَی اللّهِ وَتَوَسَّلتُ بِکُم اِلیَ اللّهِ وَاستَشفَعتُ بِکُم اِلَی اللّهِ فَاشفَعُوا لی عِندَاللّهِ وَاستَنقِذُنی مِن ذُنُوبی عِنداللّهِ فَاِنَّکُم وَسیلِتی اِلَی اللّهِ وَ بِحُبِّکُم وَ بِحُبِّکُم وَ بِقُربِکُم اَرجوُ نَجاةً مِنَ اللّهِ فَکُونُوا عِندَاللّه رَجائی یا سادَتی یا اَولِیاءَ اللّهِ صَلَّی اللّهُ عََلَیهِم اِجمَعینَ وَ لَعَنَ اللّهُ اَعداءَ اللّهِ ظالِمیهِم مِن الاَوَّلینَ وَالاخِرینَ امینَ رَبَّ العالَمینَ
التماس دعا 🌹AxE🦋
 ]]
return tdbot.sendMessage(msg.to.id, 0,1, tavassol1,1,'html'),
tdbot.sendMessage(msg.to.id,0,1, tavassol2,1,'html')
end
if matches[1]:lower () == 'دعای کمیل' and is_mod(msg) or matches[1] == 'کمیل' and is_mod(msg) then
local komeyl1 = [[
دعای کمیل :

🌺 بِسمِ الله رحمن الرحیم 🌺
اللَّهُمَّ إِنِّي أَسْأَلُكَ بِرَحْمَتِكَ الَّتِي وَسِعَتْ كُلَّ شَيْ ءٍ وَ بِقُوَّتِكَ الَّتِي قَهَرْتَ بِهَا كُلَّ شَيْ ءٍ وَ خَضَعَ لَهَا كُلُّ شَيْ ءٍ وَ ذَلَّ لَهَا كُلُّ شَيْ ءٍ وَ بِجَبَرُوتِكَ الَّتِي غَلَبْتَ بِهَا كُلَّ شَيْ ءٍ وَ بِعِزَّتِكَ الَّتِي لاَ يَقُومُ لَهَا شَيْ ءٌ وَ بِعَظَمَتِكَ الَّتِي مَلَأَتْ كُلَّ شَيْ ءٍ وَ بِسُلْطَانِكَ الَّذِي عَلاَ كُلَّ شَيْ ءٍ وَ بِوَجْهِكَ الْبَاقِي بَعْدَ فَنَاءِ كُلِّ شَيْ ءٍ وَ بِأَسْمَائِكَ الَّتِي مَلَأَتْ (غَلَبَتْ) أَرْكَانَ كُلِّ شَيْ ءٍ وَ بِعِلْمِكَ الَّذِي أَحَاطَ بِكُلِّ شَيْ ءٍ وَ بِنُورِ وَجْهِكَ الَّذِي أَضَاءَ لَهُ كُلُّ شَيْ ءٍ يَا نُورُ يَا قُدُّوسُ

يَا أَوَّلَ الْأَوَّلِينَ وَ يَا آخِرَ الْآخِرِينَ اللَّهُمَّ اغْفِرْ لِيَ الذُّنُوبَ الَّتِي تَهْتِكُ الْعِصَمَ اللَّهُمَّ اغْفِرْ لِيَ الذُّنُوبَ الَّتِي تُنْزِلُ النِّقَمَ اللَّهُمَّ اغْفِرْ لِيَ الذُّنُوبَ الَّتِي تُغَيِّرُ النِّعَمَ اللَّهُمَّ اغْفِرْ لِيَ الذُّنُوبَ الَّتِي تَحْبِسُ الدُّعَاءَ اللَّهُمَّ اغْفِرْ لِيَ الذُّنُوبَ الَّتِي تُنْزِلُ الْبَلاَءَ اللَّهُمَّ اغْفِرْ لِي كُلَّ ذَنْبٍ أَذْنَبْتُهُ وَ كُلَّ خَطِيئَةٍ أَخْطَأْتُهَا اللَّهُمَّ إِنِّي أَتَقَرَّبُ إِلَيْكَ بِذِكْرِكَ وَ أَسْتَشْفِعُ بِكَ إِلَى نَفْسِكَ وَ أَسْأَلُكَ بِجُودِكَ أَنْ تُدْنِيَنِي مِنْ قُرْبِكَ وَ أَنْ تُوزِعَنِي شُكْرَكَ وَ أَنْ تُلْهِمَنِي ذِكْرَكَ اللَّهُمَّ إِنِّي أَسْأَلُكَ سُؤَالَ خَاضِعٍ مُتَذَلِّلٍ خَاشِعٍ أَنْ تُسَامِحَنِي وَ تَرْحَمَنِي وَ تَجْعَلَنِي بِقِسْمِكَ رَاضِياً قَانِعاً وَ فِي جَمِيعِ الْأَحْوَالِ مُتَوَاضِعاً اللَّهُمَّ وَ أَسْأَلُكَ سُؤَالَ مَنِ اشْتَدَّتْ فَاقَتُهُ وَ أَنْزَلَ بِكَ عِنْدَ الشَّدَائِدِ حَاجَتَهُ وَ عَظُمَ فِيمَا عِنْدَكَ رَغْبَتُهُ اللَّهُمَّ عَظُمَ سُلْطَانُكَ وَ عَلاَ مَكَانُكَ وَ خَفِيَ مَكْرُكَ وَ ظَهَرَ أَمْرُكَ وَ غَلَبَ قَهْرُكَ وَ جَرَتْ قُدْرَتُكَ وَ لاَ يُمْكِنُ الْفِرَارُ مِنْ حُكُومَتِكَ اللَّهُمَّ لاَ أَجِدُ لِذُنُوبِي غَافِراً وَ لاَ لِقَبَائِحِي سَاتِراً وَ لاَ لِشَيْ ءٍ مِنْ عَمَلِيَ الْقَبِيحِ بِالْحَسَنِ مُبَدِّلاً غَيْرَكَ لاَ إِلَهَ إِلاَّ أَنْتَ سُبْحَانَكَ وَ بِحَمْدِكَ ظَلَمْتُ نَفْسِي
]]
local komeyl2 = [[
وَ تَجَرَّأْتُ بِجَهْلِي وَ سَكَنْتُ إِلَى قَدِيمِ ذِكْرِكَ لِي وَ مَنِّكَ عَلَيَ اللَّهُمَّ مَوْلاَيَ كَمْ مِنْ قَبِيحٍ سَتَرْتَهُ وَ كَمْ مِنْ فَادِحٍ مِنَ الْبَلاَءِ أَقَلْتَهُ (أَمَلْتَهُ) وَ كَمْ مِنْ عِثَارٍ وَقَيْتَهُ وَ كَمْ مِنْ مَكْرُوهٍ دَفَعْتَهُ وَ كَمْ مِنْ ثَنَاءٍ جَمِيلٍ لَسْتُ أَهْلاً لَهُ نَشَرْتَهُ اللَّهُمَّ عَظُمَ بَلاَئِي وَ أَفْرَطَ بِي سُوءُ حَالِي وَ قَصُرَتْ (قَصَّرَتْ) بِي أَعْمَالِي وَ قَعَدَتْ بِي أَغْلاَلِي وَ حَبَسَنِي عَنْ نَفْعِي بُعْدُ أَمَلِي (آمَالِي) وَ خَدَعَتْنِي الدُّنْيَا بِغُرُورِهَا وَ نَفْسِي بِجِنَايَتِهَا (بِخِيَانَتِهَا) وَ مِطَالِي يَا سَيِّدِي فَأَسْأَلُكَ بِعِزَّتِكَ أَنْ لاَ يَحْجُبَ عَنْكَ دُعَائِي سُوءُ عَمَلِي وَ فِعَالِي وَ لاَ تَفْضَحْنِي بِخَفِيِّ مَا اطَّلَعْتَ عَلَيْهِ مِنْ سِرِّي وَ لاَ تُعَاجِلْنِي بِالْعُقُوبَةِ عَلَى مَا عَمِلْتُهُ فِي خَلَوَاتِي مِنْ سُوءِ فِعْلِي وَ إِسَاءَتِي وَ دَوَامِ تَفْرِيطِي وَ جَهَالَتِي وَ كَثْرَةِ شَهَوَاتِي وَ غَفْلَتِي وَ كُنِ اللَّهُمَّ بِعِزَّتِكَ لِي فِي كُلِّ الْأَحْوَالِ (فِي الْأَحْوَالِ كُلِّهَا) رَءُوفاً وَ عَلَيَّ فِي جَمِيعِ الْأُمُورِ عَطُوفاً إِلَهِي وَ رَبِّي مَنْ لِي غَيْرُكَ أَسْأَلُهُ كَشْفَ ضُرِّي وَ النَّظَرَ فِي أَمْرِي إِلَهِي وَ مَوْلاَيَ أَجْرَيْتَ عَلَيَّ حُكْماً اتَّبَعْتُ فِيهِ هَوَى نَفْسِي وَ لَمْ أَحْتَرِسْ فِيهِ مِنْ تَزْيِينِ عَدُوِّي فَغَرَّنِي بِمَا أَهْوَى وَ أَسْعَدَهُ عَلَى ذَلِكَ الْقَضَاءُ فَتَجَاوَزْتُ بِمَا جَرَى عَلَيَّ مِنْ ذَلِكَ بَعْضَ (مِنْ نَقْضِ) حُدُودِكَ وَ خَالَفْتُ بَعْضَ أَوَامِرِكَ فَلَكَ الْحَمْدُ (الْحُجَّةُ) عَلَيَّ فِي جَمِيعِ ذَلِكَ وَ لاَ حُجَّةَ لِي فِيمَا جَرَى عَلَيَّ فِيهِ قَضَاؤُكَ وَ أَلْزَمَنِي حُكْمُكَ وَ بَلاَؤُكَ وَ قَدْ أَتَيْتُكَ يَا إِلَهِي بَعْدَ تَقْصِيرِي وَ إِسْرَافِي عَلَى نَفْسِي مُعْتَذِراً نَادِماً مُنْكَسِراً مُسْتَقِيلاً مُسْتَغْفِراً مُنِيباً مُقِرّاً مُذْعِناً مُعْتَرِفاً لاَ أَجِدُ مَفَرّاً مِمَّا كَانَ مِنِّي وَ لاَ مَفْزَعاً أَتَوَجَّهُ إِلَيْهِ فِي أَمْرِي غَيْرَ قَبُولِكَ عُذْرِي وَ إِدْخَالِكَ إِيَّايَ فِي سَعَةِ (سَعَةٍ مِنْ) رَحْمَتِكَ اللَّهُمَّ (إِلَهِي) فَاقْبَلْ عُذْرِي وَ ارْحَمْ شِدَّةَ ضُرِّي وَ فُكَّنِي مِنْ شَدِّ وَثَاقِي يَا رَبِّ ارْحَمْ ضَعْفَ بَدَنِي
]]
local komeyl3 =[[
وَ رِقَّةَ جِلْدِي وَ دِقَّةَ عَظْمِي يَا مَنْ بَدَأَ خَلْقِي وَ ذِكْرِي وَ تَرْبِيَتِي وَ بِرِّي وَ تَغْذِيَتِي هَبْنِي لاِبْتِدَاءِ كَرَمِكَ وَ سَالِفِ بِرِّكَ بِي يَا إِلَهِي وَ سَيِّدِي وَ رَبِّي أَ تُرَاكَ مُعَذِّبِي بِنَارِكَ بَعْدَ تَوْحِيدِكَ وَ بَعْدَ مَا انْطَوَى عَلَيْهِ قَلْبِي مِنْ مَعْرِفَتِكَ وَ لَهِجَ بِهِ لِسَانِي مِنْ ذِكْرِكَ وَ اعْتَقَدَهُ ضَمِيرِي مِنْ حُبِّكَ وَ بَعْدَ صِدْقِ اعْتِرَافِي وَ دُعَائِي خَاضِعاً لِرُبُوبِيَّتِكَ هَيْهَاتَ أَنْتَ أَكْرَمُ مِنْ أَنْ تُضَيِّعَ مَنْ رَبَّيْتَهُ أَوْ تُبْعِدَ (تُبَعِّدَ) مَنْ أَدْنَيْتَهُ أَوْ تُشَرِّدَ مَنْ آوَيْتَهُ أَوْ تُسَلِّمَ إِلَى الْبَلاَءِ مَنْ كَفَيْتَهُ وَ رَحِمْتَهُ وَ لَيْتَ شِعْرِي يَا سَيِّدِي وَ إِلَهِي وَ مَوْلاَيَ أَ تُسَلِّطُ النَّارَ عَلَى وُجُوهٍ خَرَّتْ لِعَظَمَتِكَ سَاجِدَةً وَ عَلَى أَلْسُنٍ نَطَقَتْ بِتَوْحِيدِكَ صَادِقَةً وَ بِشُكْرِكَ مَادِحَةً وَ عَلَى قُلُوبٍ اعْتَرَفَتْ بِإِلَهِيَّتِكَ مُحَقِّقَةً وَ عَلَى ضَمَائِرَ حَوَتْ مِنَ الْعِلْمِ بِكَ حَتَّى صَارَتْ خَاشِعَةً وَ عَلَى جَوَارِحَ سَعَتْ إِلَى أَوْطَانِ تَعَبُّدِكَ طَائِعَةً وَ أَشَارَتْ بِاسْتِغْفَارِكَ مُذْعِنَةً مَا هَكَذَا الظَّنُّ بِكَ وَ لاَ أُخْبِرْنَا بِفَضْلِكَ عَنْكَ يَا كَرِيمُ يَا رَبِ

وَ أَنْتَ تَعْلَمُ ضَعْفِي عَنْ قَلِيلٍ مِنْ بَلاَءِ الدُّنْيَا وَ عُقُوبَاتِهَا وَ مَا يَجْرِي فِيهَا مِنَ الْمَكَارِهِ عَلَى أَهْلِهَا عَلَى أَنَّ ذَلِكَ بَلاَءٌ وَ مَكْرُوهٌ، قَلِيلٌ مَكْثُهُ، يَسِيرٌ بَقَاؤُهُ، قَصِيرٌ مُدَّتُهُ فَكَيْفَ احْتِمَالِي لِبَلاَءِ الْآخِرَةِ وَ جَلِيلِ (حُلُولِ) وُقُوعِ الْمَكَارِهِ فِيهَا وَ هُوَ بَلاَءٌ تَطُولُ مُدَّتُهُ وَ يَدُومُ مَقَامُهُ وَ لاَ يُخَفَّفُ عَنْ أَهْلِهِ لِأَنَّهُ لاَ يَكُونُ إِلاَّ عَنْ غَضَبِكَ وَ انْتِقَامِكَ وَ سَخَطِكَ وَ هَذَا مَا لاَ تَقُومُ لَهُ السَّمَاوَاتُ وَ الْأَرْضُ يَا سَيِّدِي فَكَيْفَ لِي (بِي) وَ أَنَا عَبْدُكَ الضَّعِيفُ الذَّلِيلُ الْحَقِيرُ الْمِسْكِينُ الْمُسْتَكِينُ يَا إِلَهِي وَ رَبِّي وَ سَيِّدِي وَ مَوْلاَيَ لِأَيِّ الْأُمُورِ إِلَيْكَ أَشْكُو وَ لِمَا مِنْهَا أَضِجُّ وَ أَبْكِي لِأَلِيمِ الْعَذَابِ وَ شِدَّتِهِ أَمْ لِطُولِ الْبَلاَءِ وَ مُدَّتِهِ فَلَئِنْ صَيَّرْتَنِي لِلْعُقُوبَاتِ مَعَ أَعْدَائِكَ وَ جَمَعْتَ بَيْنِي وَ بَيْنَ أَهْلِ بَلاَئِكَ وَ فَرَّقْتَ بَيْنِي وَ بَيْنَ أَحِبَّائِكَ وَ أَوْلِيَائِكَ فَهَبْنِي يَا إِلَهِي وَ سَيِّدِي وَ مَوْلاَيَ وَ رَبِّي صَبَرْتُ عَلَى عَذَابِكَ فَكَيْفَ أَصْبِرُ عَلَى فِرَاقِكَ وَ هَبْنِي (يَا إِلَهِي) صَبَرْتُ عَلَى حَرِّ نَارِكَ فَكَيْفَ أَصْبِرُ عَنِ النَّظَرِ إِلَى كَرَامَتِكَ أَمْ كَيْفَ أَسْكُنُ فِي النَّارِ وَ رَجَائِي عَفْوُكَ فَبِعِزَّتِكَ يَا سَيِّدِي وَ مَوْلاَيَ أُقْسِمُ صَادِقاً لَئِنْ تَرَكْتَنِي نَاطِقاً لَأَضِجَّنَّ إِلَيْكَ بَيْنَ أَهْلِهَا ضَجِيجَ الْآمِلِينَ (الْآلِمِينَ) وَ لَأَصْرُخَنَّ إِلَيْكَ صُرَاخَ الْمُسْتَصْرِخِينَ وَ لَأَبْكِيَنَّ عَلَيْكَ بُكَاءَ الْفَاقِدِينَ وَ لَأُنَادِيَنَّكَ أَيْنَ كُنْتَ يَا وَلِيَّ الْمُؤْمِنِينَ يَا غَايَةَ آمَالِ الْعَارِفِينَ يَا غِيَاثَ الْمُسْتَغِيثِينَ
]]
local komeyl4 =[[
يَا حَبِيبَ قُلُوبِ الصَّادِقِينَ وَ يَا إِلَهَ الْعَالَمِينَ أَ فَتُرَاكَ سُبْحَانَكَ يَا إِلَهِي وَ بِحَمْدِكَ تَسْمَعُ فِيهَا صَوْتَ عَبْدٍ مُسْلِمٍ سُجِنَ (يُسْجَنُ) فِيهَا بِمُخَالَفَتِهِ وَ ذَاقَ طَعْمَ عَذَابِهَا بِمَعْصِيَتِهِ وَ حُبِسَ بَيْنَ أَطْبَاقِهَا بِجُرْمِهِ وَ جَرِيرَتِهِ وَ هُوَ يَضِجُّ إِلَيْكَ ضَجِيجَ مُؤَمِّلٍ لِرَحْمَتِكَ وَ يُنَادِيكَ بِلِسَانِ أَهْلِ تَوْحِيدِكَ وَ يَتَوَسَّلُ إِلَيْكَ بِرُبُوبِيَّتِكَ يَا مَوْلاَيَ فَكَيْفَ يَبْقَى فِي الْعَذَابِ وَ هُوَ يَرْجُو مَا سَلَفَ مِنْ حِلْمِكَ أَمْ كَيْفَ تُؤْلِمُهُ النَّارُ وَ هُوَ يَأْمُلُ فَضْلَكَ وَ رَحْمَتَكَ أَمْ كَيْفَ يُحْرِقُهُ لَهِيبُهَا وَ أَنْتَ تَسْمَعُ صَوْتَهُ وَ تَرَى مَكَانَهُ أَمْ كَيْفَ يَشْتَمِلُ عَلَيْهِ زَفِيرُهَا وَ أَنْتَ تَعْلَمُ ضَعْفَهُ أَمْ كَيْفَ يَتَقَلْقَلُ بَيْنَ أَطْبَاقِهَا وَ أَنْتَ تَعْلَمُ صِدْقَهُ أَمْ كَيْفَ تَزْجُرُهُ زَبَانِيَتُهَا وَ هُوَ يُنَادِيكَ يَا رَبَّهْ أَمْ كَيْفَ يَرْجُو فَضْلَكَ فِي عِتْقِهِ مِنْهَا فَتَتْرُكُهُ (فَتَتْرُكَهُ) فِيهَا هَيْهَاتَ مَا ذَلِكَ الظَّنُّ بِكَ وَ لاَ الْمَعْرُوفُ مِنْ فَضْلِكَ وَ لاَ مُشْبِهٌ لِمَا عَامَلْتَ بِهِ الْمُوَحِّدِينَ مِنْ بِرِّكَ وَ إِحْسَانِكَ فَبِالْيَقِينِ أَقْطَعُ لَوْ لاَ مَا حَكَمْتَ بِهِ مِنْ تَعْذِيبِ جَاحِدِيكَ وَ قَضَيْتَ بِهِ مِنْ إِخْلاَدِ مُعَانِدِيكَ لَجَعَلْتَ النَّارَ كُلَّهَا بَرْداً وَ سَلاَماً وَ مَا كَانَ (كَانَتْ) لِأَحَدٍ فِيهَا مَقَرّاً وَ لاَ مُقَاماً (مَقَاماً) لَكِنَّكَ تَقَدَّسَتْ أَسْمَاؤُكَ أَقْسَمْتَ أَنْ تَمْلَأَهَا مِنَ الْكَافِرِينَ مِنَ الْجِنَّةِ وَ النَّاسِ أَجْمَعِينَ وَ أَنْ تُخَلِّدَ فِيهَا الْمُعَانِدِينَ وَ أَنْتَ جَلَّ ثَنَاؤُكَ قُلْتَ مُبْتَدِئاً وَ تَطَوَّلْتَ بِالْإِنْعَامِ مُتَكَرِّماً اَفَمَنْ كانَ مُؤْمِناً كَمَنْ كانَ فاسِقاً لا يَسْتَوُونَ اِلهى وَ سَيِّدى فَاَسْئَلُكَ بِالْقُدْرَةِ الَّتى قَدَّرْتَها وَ بِالْقَضِيَّةِ الَّتى حَتَمْتَها وَ حَكَمْتَها وَ غَلَبْتَ مَنْ عَلَيْهِ اَجْرَيْتَها اَنْ تَهَبَ لى فى هذِهِ اللَّيْلَةِ وَ فى هذِهِ السّاعَةِ كُلَّ جُرْمٍ اَجْرَمْتُهُ وَ كُلَّ ذَنْبٍ أَذْنَبْتُهُ وَ كُلَّ قَبِيحٍ أَسْرَرْتُهُ وَ كُلَّ جَهْلٍ عَمِلْتُهُ كَتَمْتُهُ اَوْ أَعْلَنْتُهُ أَخْفَيْتُهُ اَوْ اَظْهَرْتُهُ وَ كُلَّ سَيِّئَةٍ أَمَرْتَ بِاِثْباتِهَا الْكِرامَ الْكاتِبينَ الَّذينَ وَكَّلْتَهُمْ بِحِفْظِ ما يَكُونُ مِنّى وَ جَعَلْتَهُمْ شُهُوداً عَلَىَّ مَعَ جَوارِحى وَ كُنْتَ اَنْتَ الرَّقيبَ عَلَىَّ مِنْ وَراَّئِهِمْ وَالشّاهِدَ لِما خَفِىَ عَنْهُمْ وَ بِرَحْمَتِكَ اَخْفَيْتَهُ وَ بِفَضْلِكَ سَتَرْتَهُ وَ اَنْ تُوَفِّرَ حَظّى مِنْ كُلِّ خَيْرٍ اَنْزَلْتَهُ اَوْ اِحْسانٍ فَضَّلْتَهُ اَوْ بِرٍّ نَشَرْتَهُ اَوْ رِزْقٍ بَسَطْتَهُ اَوْ ذَنْبٍ تَغْفِرُهُ اَوْ خَطَاءٍ تَسْتُرُهُ يا رَبِّ يا رَبِّ يا رَبِّ
]]
local komeyl5 =[[
يا اِلهى وَ سَيِّدى وَ مَوْلاىَ وَ مالِكَ رِقّى يا مَنْ بِيَدِهِ ناصِيَتى يا عَليماً بِضُرّى وَ مَسْكَنَتى يا خَبيراً بِفَقْرى وَ فاقَتى يا رَبِّ يا رَبِّ يا رَبِّ اَسْئَلُكَ بِحَقِّكَ وَ قُدْسِكَ وَ اَعْظَمِ صِفاتِكَ وَ اَسْماَّئِكَ اَنْ تَجْعَلَ اَوْقاتى مِنَ اللَّيْلِ وَالنَّهارِ بِذِكْرِكَ مَعْمُورَةً وَ بِخِدْمَتِكَ مَوْصُولَةً وَ اَعْمالى عِنْدَكَ مَقْبُولَةً حَتّى تَكُونَ اَعْمالى وَ اَوْرادى كُلُّها وِرْداً واحِداً وَ حالى فى خِدْمَتِكَ سَرْمَداً يا سَيِّدى يا مَنْ عَلَيْهِ مُعَوَّلى يا مَنْ اِلَيْهِ شَكَوْتُ اَحْوالى يا رَبِّ يا رَبِّ يا رَبِّ قَوِّ عَلى خِدْمَتِكَ جَوارِحى وَاشْدُدْ عَلَى الْعَزيمَةِ جَوانِحى وَ هَبْ لِىَ الْجِدَّ فى خَشْيَتِكَ وَالدَّوامَ فِى الاِْتِّصالِ بِخِدْمَتِكَ حَتّى اَسْرَحَ اِلَيْكَ فى مَيادينِ السّابِقينَ وَ أُسْرِعَ اِلَيْكَ فِى الْبارِزينَ وَ أَشْتاقَ اِلى قُرْبِكَ فِى الْمُشْتاقينَ وَ أَدْنُوَ مِنْكَ دُنُوَّ الْمُخْلِصينَ وَ اَخافَكَ مَخافَةَ الْمُوقِنينَ وَ اَجْتَمِعَ فى جِوارِكَ مَعَ الْمُؤْمِنينَ اَللّهُمَّ وَ مَنْ اَرادَنى بِسُوَّءٍ فَاَرِدْهُ وَ مَنْ كادَنى فَكِدْهُ وَاجْعَلْنى مِنْ اَحْسَنِ عَبيدِكَ نَصيباً عِنْدَكَ وَ اَقْرَبِهِمْ مَنْزِلَةً مِنْكَ وَ اَخَصِّهِمْ زُلْفَةً لَدَيْكَ فَاِنَّهُ لا يُنالُ ذلِكَ اِلاّ بِفَضْلِكَ وَ جُدْلى بِجُودِكَ وَاعْطِفْ عَلَىَّ بِمَجْدِكَ وَاحْفَظْنى بِرَحْمَتِكَ وَاجْعَلْ لِسانى بِذِكْرِكَ لَهِجاً وَ قَلْبى بِحُبِّكَ مُتَيَّماً وَ مُنَّ عَلَىَّ بِحُسْنِ اِجابَتِكَ وَ اَقِلْنى عَثْرَتى وَاغْفِرْ زَلَّتى فَاِنَّكَ قَضَيْتَ عَلى عِبادِكَ بِعِبادَتِكَ وَ اَمَرْتَهُمْ بِدُعاَّئِكَ وَ ضَمِنْتَ لَهُمُ الإِجابَةَ فَاِلَيْكَ يا رَبِّ نَصَبْتُ وَجْهى وَ اِلَيْكَ يا رَبِّ مَدَدْتُ يَدى فَبِعِزَّتِكَ اسْتَجِبْ لى دُعاَّئى وَ بَلِّغْنى مُناىَ وَ لا تَقْطَعْ مِنْ فَضْلِكَ رَجاَّئى وَاكْفِنى شَرَّ الْجِنِّ وَالاِْنْسِ مِنْ اَعْدآئى، يا سَريعَ الرِّضا 

اِغْفِرْ لِمَنْ لا يَمْلِكُ اِلّا الدُّعاَّءَ فَاِنَّكَ فَعّالٌ لِما تَشاَّءُ يا مَنِ اسْمُهُ دَوآءٌ وَ ذِكْرُهُ شِفاَّءٌ وَ طاعَتُهُ غِنىً اِرْحَمْ مَنْ رَأسُ مالِهِ الرَّجاَّءُ وَ سِلاحُهُ الْبُكاَّءُ يا سابِغَ النِّعَمِ يا دافِعَ النِّقَمِ يا نُورَ الْمُسْتَوْحِشينَ فِى الْظُّلَمِ يَا عالِماً لا يُعَلَّمُ صَلِّ عَلى مُحَمَّدٍ وَآلِ مُحَمَّدٍ وَافْعَلْ بى مَا اَنْتَ أَهْلُهُ وَ صَلَّى اللّهُ عَلى رَسُولِهِ وَالْأَئِمَّةِ الْمَيامينَ مِنْ الِهِ وَ سَلَّمَ تَسْليماً كَثيراً.

التماس دعا 🌹AxE🦋
]]
return tdbot.sendMessage(msg.to.id,0,1, komeyl1,1,'html') ,
tdbot.sendMessage(msg.to.id,0,1, komeyl2,1,'html') ,
tdbot.sendMessage(msg.to.id,0,1, komeyl3,1,'html') ,
tdbot.sendMessage(msg.to.id,0,1, komeyl4,1,'html') ,
tdbot.sendMessage(msg.to.id,0,1, komeyl5,1,'html')
end
if matches[1] == 'دعای عهد' and is_mod(msg) or matches[1] == 'عهد' and is_mod(msg) then
return [[
♡دعای عهد♡
🌺 بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحیمْ 🌺
💠اَللّهُمَّ رَبَّ النُّورِ الْعَظیمِ،💠 وَ رَبَّ الْکُرْسِىِّ الرَّفیعِ،💠 وَ رَبَّ الْبَحْرِ الْمَسْجُورِ،💠 وَ مُنْزِلَ التَّوْراةِ وَالْإِنْجیلِ وَالزَّبُورِ،💠 وَ رَبَّ الظِّلِّ وَالْحَرُورِ،💠 وَ مُنْزِلَ الْقُرْآنِ الْعَظیمِ، وَ رَبَّ الْمَلائِکَةِ الْمُقَرَّبینَ، 💠وَالْأَنْبِیاءِ وَالْمُرْسَلینَ اَللّهُمَّ إِنّى أَسْأَلُکَ بوَجْهِکَ الْکَریمِ،💠 وَ بِنُورِ وَجْهِکَ الْمُنیرِ، وَ مُلْکِکَ الْقَدیمِ،💠 یا حَىُّ یا قَیُّومُ، أَسْأَلُکَ بِاسْمِکَ الَّذى أَشْرَقَتْ بِهِ السَّمواتُ وَالْأَرَضُونَ، 💠وَ بِاسْمِکَ الَّذى یَصْلَحُ بِهِ الْأَوَّلُونَ وَالْآخِرُونَ، 💠یا حَیّاً قَبْلَ کُلِّ حَىٍّ، وَ یا حَیّاً بَعْدَ کُلِّ حَىٍّ،💠 وَ یا حَیّاً حینَ لا حَىَّ، 💠یا مُحْیِىَ الْمَوْتى، وَ مُمیتَ الْأَحْیاءِ،💠 یا حَىُّ لا إِلهَ إِلّا أَنْتَ.💠

اَللّهُمَّ بَلِّغْ مَوْلانَا الْإِمامَ الْهادِىَ الْمَهْدِىَّ الْقائِمَ بِأَمْرِکَ،💠 صَلَواتُ اللَّهِ عَلَیْهِ وَ عَلى آبائِهِ الطّاهِرینَ،💠 عَنْ جَمیعِ الْمُؤْمِنینَ وَالْمُؤْمِناتِ فى مَشارِقِ الْأَرْضِ وَ مَغارِبِها،💠 سَهْلِها وَ جَبَلِها، 💠وَ بَرِّها وَ بَحْرِها، وَ عَنّى وَ عَنْ والِدَىَّ مِنَ الصَّلَواتِ زِنَةَ عَرْشِ اللَّهِ، 💠وَ مِدادَ کَلِماتِهِ، وَ ما أَحْصاهُ عِلْمُهُ،💠 وَ أَحاطَ بِهِ کِتابُهُ.💠 أَللّهُمِّ إِنّى أُجَدِّدُ لَهُ فى صَبیحَةِ یَوْمى هذا،💠 وَ ما عِشْتُ مِنْ أَیّامى عَهْداً وَ عَقْداً وَ بَیْعَةً لَهُ فى عُنُقى، 💠لا أَحُولُ عَنْها، وَ لا أَزُولُ أَبَداً.💠 اَللّهُمَّ اجْعَلْنى مِنْ أَنْصارِهِ وَ أَعَوانِهِ، 💠وَالذّابّینَ عَنْهُ، وَالْمُسارِعینَ إِلَیْهِ فى قَضاءِ حَوائِجِهِ، وَالْمُمْتَثِلینَ لِأَوامِرِهِ، وَالْمُحامینَ عَنْهُ،💠 وَالسّابِقینَ إِلى إِرادَتِهِ، وَالْمُسْتَشْهَدینَ بَیْنَ یَدَیْهِ.💠

اَللّهُمَّ إِنْ حالَ بَیْنى وَ بَیْنَهُ الْمَوْتُ الَّذى جَعَلْتَهُ عَلى عِبادِکَ حَتْماً مَقْضِیّاً، 💠فَأَخْرِجْنى مِنْ قَبْرى مُؤْتَزِراً کَفَنى،💠 شاهِراً سَیْفى، مُجَرِّداً قَناتى،💠 مُلَبِّیاً دَعْوَةَ الدّاعى فِى الْحاضِرِ وَالْبادى.💠 اَللّهُمَّ أَرِنِى  الطَّلْعَةَ الرَّشیدَةَ  وَالْغُرَّةَ الْحَمیدَةَ،💠 وَاکْحَُلْ ناظِرى بِنَظْرَةٍ مِنّى إِلَیْهِ، 💠وَ عَجِّلْ فَرَجَهُ، وَ سَهِّلْ مَخْرَجَهُ،💠 وَ أَوْسِعْ مَنْهَجَهُ، وَاسْلُکْ بى مَحَجَّتَهُ، 💠وَ أَنْفِذْ أَمْرَهُ، وَاشْدُدْ أَزْرَهُ، 💠وَاعْمُرِ اللّهُمَّ بِهِ بِلادَکَ ، وَ أَحْىِ بِهِ عِبادَکَ،💠 فَإِنَّکَ قُلْتَ وَ قَوْلُکَ الْحَقُّ:💠 ظَهَرَ الْفَسادُ فِى الْبَرِّ وَالْبَحْرِ بِما کَسَبَتْ أَیْدِى النّاسِ، 💠فَأَظْهِرِ اللّهُمَّ لَنا وَلِیَّکَ وَابْنَ بِنْتِ نَبِیِّکَ الْمُسَمّى بِاسْمِ رَسُولِک💠َ
حَتّى لا یَظْفَرَ بِشَىْءٍ مِنَ الْباطِلِ إِلّا مَزَّقَهُ، 💠وَ یُحِقَّ الْحَقَّ وَ یُحَقِّقَهُ،💠 وَاجْعَلْهُ اللّهُمَّ مَفْزَعاً لِمَظْلُومِ عِبادِکَ  وَ ناصِراً لِمَنْ لا یَجِدُ لَهُ ناصِراً غَیْرَکَ،💠 وَ مُجَدِّداً لِما عُطِّلَ مِنْ أَحْکامِ کِتابِکَ،💠 وَ مُشَیِّداً لِما وَرَدَ مِنْ أَعْلامِ دینِکَ، 💠وَ سُنَنِ نَبِیِّکَ صَلَّى اللَّهُ عَلَیْهِ وَ آلِهِ،💠 وَاجْعَلْهُ اللّهُمَّ مِمَّنْ حَصَّنْتَهُ مِنْ بَأْسِ الْمُعْتَدینَ،💠 اَللّهُمَّ وَ سُرَّ نَبِیَّکَ مُحَمَّداً صَلَّى اللَّهُ عَلَیْهِ وَ آلِهِ بِرُؤْیَتِهِ،💠وَ مَنْ تَبِعَهُ عَلى دَعْوَتِهِ،💠 وَارْحَمِ اسْتِکانَتَنا بَعْدَهُ ،💠 اللّهُمَّ اکْشِفْ هذِهِ الْغُمَّةَ عَنْ هذِهِ الْأُمَّةِ بِحُضُورِهِ، 💠وَ عَجِّلْ لَنا ظُهُورَهُ، 💠إِنَّهُمْ یَرَوْنَهُ بَعیداً وَ نَراهُ قَریباً، 💠بِرَحْمَتِکَ یا أَرْحَمَ الرّاحِمینَ.💠

☆اَلْعَجَلَ، اَلْعَجَلَ؛ یا مَولای یا صاحِبَ الزَّمان☆ِ

☆اَلْعَجَلَ، اَلْعَجَلَ؛ یا مَولای یا صاحِبَ الزَّمان☆ِ

☆اَلْعَجَلَ، اَلْعَجَلَ؛ یا مَولای یا صاحِبَ الزَّمان☆
ِ
♡ اَللّهُمَّ عَجِّلْ لِوَلِیِّکَ الْفَرج♡

♢سلامتی مولامون صاحب الزمان‌ صلوات♢

⇦التماس دعا➣ 🦋AxE🌹
]]
end
if matches[1] == 'دعای فرج' and is_mod(msg) then
return [[
🌺 دعای فرج :

إِلَهِي عَظُمَ الْبَلاءُ وَ بَرِحَ الْخَفَاءُ وَ انْكَشَفَ الْغِطَاءُ وَ انْقَطَعَ الرَّجَاءُ وَ ضَاقَتِ الْأَرْضُ وَ مُنِعَتِ السَّمَاءُ وَ أَنْتَ الْمُسْتَعَانُ وَ إِلَيْكَ الْمُشْتَكَى وَ عَلَيْكَ الْمُعَوَّلُ فِي الشِّدَّةِ وَ الرَّخَاءِ اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَ آلِ مُحَمَّدٍ أُولِي الْأَمْرِ الَّذِينَ فَرَضْتَ عَلَيْنَا طَاعَتَهُمْ وَ عَرَّفْتَنَا بِذَلِكَ مَنْزِلَتَهُمْ فَفَرِّجْ عَنَّا بِحَقِّهِمْ فَرَجاً عَاجِلاً قَرِيباً كَلَمْحِ الْبَصَرِ أَوْ هُوَ أَقْرَبُ يَا مُحَمَّدُ يَا عَلِيُّ يَا عَلِيُّ يَا مُحَمَّدُ اكْفِيَانِي فَإِنَّكُمَا كَافِيَانِ وَ انْصُرَانِي فَإِنَّكُمَا نَاصِرَانِ يَا مَوْلانَا يَا صَاحِبَ الزَّمَانِ الْغَوْثَ الْغَوْثَ الْغَوْثَ أَدْرِكْنِي أَدْرِكْنِي أَدْرِكْنِي السَّاعَةَ السَّاعَةَ السَّاعَةَ الْعَجَلَ الْعَجَلَ الْعَجَلَ يَا أَرْحَمَ الرَّاحِمِينَ بِحَقِّ مُحَمَّدٍ وَ آلِهِ الطَّاهِرِينَ
⇦التماس دعا➣ 🦋AxE🌹
]]
end
if matches[1] == 'دعای سمات' and is_mod(msg) or matches[1] == 'سمات' and is_mod(msg) then
local samat1 =[[
🌺 دعای سمات :

اللهُمَّ اِني اَسْئَلُكَ بِاسْمِكَ الْعَظيمِ الاَعْظَمِ الاَعَزِّ الاَجَلِّ الاَكْرَمِ اَلَّذي اِذا دُعيتَ بِهِ عَلى مَغالِقِ أبْوابِ السَماءِ لِلْفَتْحِ بِالرَّحْمَةِ انْفَتَحَتْ وَاِذا دُعيتَ بِهِ عَلى مَضَايقِ أبْوابِ الاَرضِ لِلِفَرَجِ انْفَرَجَتْ وَ إِذَا دُعِيتَ بِهِ عَلَى الْعُسْرِ لِلْيُسْرِ تَيَسَّرَتْ وَ إِذَا دُعِيتَ بِهِ عَلَى الْأَمْوَاتِ لِلنُّشُورِ انْتَشَرَتْ وَ إِذَا دُعِيتَ بِهِ عَلَى كَشْفِ الْبَأْسَاءِ وَ الضَّرَّاءِ انْكَشَفَتْ وَ بِجَلالِ وَجْهِكَ الْكَرِيمِ، 1

أَكْرَمِ الْوُجُوهِ وَ أَعَزِّ الْوُجُوهِ الَّذِي عَنَتْ لَهُ الْوُجُوهُ وَ خَضَعَتْ لَهُ الرِّقَابُ وَ خَشَعَتْ لَهُ الْأَصْوَاتُ وَ وَجِلَتْ لَهُ الْقُلُوبُ مِنْ مَخَافَتِكَ وَ بِقُوَّتِكَ الَّتِي بِهَا تُمْسِكُ السَّمَاءَ أَنْ تَقَعَ عَلَى الْأَرْضِ إِلا بِإِذْنِكَ وَ تُمْسِكُ السَّمَاوَاتِ وَ الْأَرْضَ أَنْ تَزُولا وَ بِمَشِيَّتِكَ الَّتِي دَانَ [كَانَ‏] لَهَا الْعَالَمُونَ، 2

وَ بِكَلِمَتِكَ الَّتِي خَلَقْتَ بِهَا السَّمَاوَاتِ وَ الْأَرْضَ وَ بِحِكْمَتِكَ الَّتِي صَنَعْتَ بِهَا الْعَجَائِبَ وَ خَلَقْتَ بِهَا الظُّلْمَةَ وَ جَعَلْتَهَا لَيْلا وَ جَعَلْتَ اللَّيْلَ سَكَنا [مَسْكَنا] وَ خَلَقْتَ بِهَا النُّورَ وَ جَعَلْتَهُ نَهَارا وَ جَعَلْتَ النَّهَارَ نُشُورا مُبْصِرا وَ خَلَقْتَ بِهَا الشَّمْسَ وَ جَعَلْتَ الشَّمْسَ ضِيَاءً وَ خَلَقْتَ بِهَا الْقَمَرَ وَ جَعَلْتَ الْقَمَرَ نُورا، 3

وَ خَلَقْتَ بِهَا الْكَوَاكِبَ وَ جَعَلْتَهَا نُجُوما وَ بُرُوجا وَ مَصَابِيحَ وَ زِينَةً وَ رُجُوما وَ جَعَلْتَ لَهَا مَشَارِقَ وَ مَغَارِبَ وَ جَعَلْتَ لَهَا مَطَالِعَ وَ مَجَارِيَ وَ جَعَلْتَ لَهَا فَلَكا وَ مَسَابِحَ وَ قَدَّرْتَهَا فِي السَّمَاءِ مَنَازِلَ فَأَحْسَنْتَ تَقْدِيرَهَا وَ صَوَّرْتَهَا فَأَحْسَنْتَ تَصْوِيرَهَا وَ أَحْصَيْتَهَا بِأَسْمَائِكَ إِحْصَاءً وَ دَبَّرْتَهَا بِحِكْمَتِكَ تَدْبِيرا وَ أَحْسَنْتَ [فَأَحْسَنْتَ‏] تَدْبِيرَهَا وَ سَخَّرْتَهَا بِسُلْطَانِ اللَّيْلِ وَ سُلْطَانِ النَّهَارِ وَ السَّاعَاتِ وَ عَدَدِ [وَ عَرَّفْتَ بِهَا عَدَدَ] السِّنِينَ وَ الْحِسَابِ وَ جَعَلْتَ رُؤْيَتَهَا لِجَمِيعِ النَّاسِ مَرْأًى وَاحِدا، 4

وَ أَسْأَلُكَ اللَّهُمَّ بِمَجْدِكَ الَّذِي كَلَّمْتَ بِهِ عَبْدَكَ وَ رَسُولَكَ مُوسَى بْنَ عِمْرَانَ عَلَيْهِ السَّلامُ فِي الْمُقَدَّسِينَ فَوْقَ إِحْسَاسِ [أَحْسَاسِ‏] الْكَرُوبِينَ [الْكَرُوبِيِّينَ‏] فَوْقَ غَمَائِمِ النُّورِ فَوْقَ تَابُوتِ الشَّهَادَةِ فِي عَمُودِ النَّارِ وَ فِي طُورِ سَيْنَاءَ وَ فِي [إِلَى‏] جَبَلِ حُورِيثَ فِي الْوَادِ الْمُقَدَّسِ فِي الْبُقْعَةِ الْمُبَارَكَةِ مِنْ جَانِبِ الطُّورِ الْأَيْمَنِ مِنَ الشَّجَرَةِ وَ فِي أَرْضِ مِصْرَ بِتِسْعِ آيَاتٍ بَيِّنَاتٍ وَ يَوْمَ فَرَقْتَ لِبَنِي إِسْرَائِيلَ الْبَحْرَ وَ فِي الْمُنْبَجِسَاتِ الَّتِي صَنَعْتَ بِهَا الْعَجَائِبَ فِي بَحْرِ سُوفٍ ، 5
]]
local samat2 =[[
وَ عَقَدْتَ مَاءَ الْبَحْرِ فِي قَلْبِ الْغَمْرِ كَالْحِجَارَةِ وَ جَاوَزْتَ بِبَنِي إِسْرَائِيلَ الْبَحْرَ وَ تَمَّتْ كَلِمَتُكَ الْحُسْنَى عَلَيْهِمْ بِمَا صَبَرُوا وَ أَوْرَثْتَهُمْ مَشَارِقَ الْأَرْضِ وَ مَغَارِبَهَا الَّتِي بَارَكْتَ فِيهَا لِلْعَالَمِينَ وَ أَغْرَقْتَ فِرْعَوْنَ وَ جُنُودَهُ وَ مَرَاكِبَهُ فِي الْيَمِّ وَ بِاسْمِكَ الْعَظِيمِ الْأَعْظَمِ [الْأَعْظَمِ‏] الْأَعَزِّ الْأَجَلِّ الْأَكْرَمِ وَ بِمَجْدِكَ الَّذِي تَجَلَّيْتَ بِهِ لِمُوسَى كَلِيمِكَ عَلَيْهِ السَّلامُ فِي طُورِ سَيْنَاءَ وَ لِإِبْرَاهِيمَ عَلَيْهِ السَّلامُ خَلِيلِكَ مِنْ قَبْلُ فِي مَسْجِدِ الْخَيْفِ، 6

وَ لِإِسْحَاقَ صَفِيِّكَ عَلَيْهِ السَّلامُ فِي بِئْرِ شِيَعٍ [سَبْعٍ‏] وَ لِيَعْقُوبَ نَبِيِّكَ عَلَيْهِ السَّلامُ فِي بَيْتِ إِيلٍ وَ أَوْفَيْتَ لِإِبْرَاهِيمَ عَلَيْهِ السَّلامُ بِمِيثَاقِكَ وَ لِإِسْحَاقَ بِحَلْفِكَ وَ لِيَعْقُوبَ بِشَهَادَتِكَ وَ لِلْمُؤْمِنِينَ بِوَعْدِكَ وَ لِلدَّاعِينَ بِأَسْمَائِكَ فَأَجَبْتَ وَ بِمَجْدِكَ الَّذِي ظَهَرَ لِمُوسَى بْنِ عِمْرَانَ عَلَيْهِ السَّلامُ عَلَى قُبَّةِ الرُّمَّانِ [الزَّمَانِ‏] [ الْهَرْمَانِ‏] وَ بِآيَاتِكَ الَّتِي وَقَعَتْ عَلَى أَرْضِ مِصْرَ بِمَجْدِ الْعِزَّةِ وَ الْغَلَبَةِ بِآيَاتٍ عَزِيزَةٍ وَ بِسُلْطَانِ الْقُوَّةِ وَ بِعِزَّةِ الْقُدْرَةِ وَ بِشَأْنِ الْكَلِمَةِ التَّامَّةِ، 7

وَ بِكَلِمَاتِكَ الَّتِي تَفَضَّلْتَ بِهَا عَلَى أَهْلِ السَّمَاوَاتِ وَ الْأَرْضِ وَ أَهْلِ الدُّنْيَا وَ أَهْلِ الْآخِرَةِ وَ بِرَحْمَتِكَ الَّتِي مَنَنْتَ بِهَا عَلَى جَمِيعِ خَلْقِكَ وَ بِاسْتِطَاعَتِكَ الَّتِي أَقَمْتَ بِهَا عَلَى الْعَالَمِينَ وَ بِنُورِكَ الَّذِي قَدْ خَرَّ مِنْ فَزَعِهِ طُورُ سَيْنَاءَ وَ بِعِلْمِكَ وَ جَلالِكَ وَ كِبْرِيَائِكَ وَ عِزَّتِكَ وَ جَبَرُوتِكَ الَّتِي لَمْ تَسْتَقِلَّهَا الْأَرْضُ وَ انْخَفَضَتْ لَهَا السَّمَاوَاتُ وَ انْزَجَرَ لَهَا الْعُمْقُ الْأَكْبَرُ وَ رَكَدَتْ لَهَا الْبِحَارُ وَ الْأَنْهَارُ وَ خَضَعَتْ لَهَا الْجِبَالُ وَ سَكَنَتْ لَهَا الْأَرْضُ بِمَنَاكِبِهَا ، 8

وَ اسْتَسْلَمَتْ لَهَا الْخَلائِقُ كُلُّهَا وَ خَفَقَتْ لَهَا الرِّيَاحُ فِي جَرَيَانِهَا وَ خَمَدَتْ لَهَا النِّيرَانُ فِي أَوْطَانِهَا وَ بِسُلْطَانِكَ الَّذِي عُرِفَتْ لَكَ بِهِ الْغَلَبَةُ دَهْرَ الدُّهُورِ وَ حُمِدْتَ بِهِ فِي السَّمَاوَاتِ وَ الْأَرَضِينَ وَ بِكَلِمَتِكَ كَلِمَةِ الصِّدْقِ الَّتِي سَبَقَتْ لِأَبِينَا آدَمَ عَلَيْهِ السَّلامُ وَ ذُرِّيَّتِهِ بِالرَّحْمَةِ وَ أَسْأَلُكَ بِكَلِمَتِكَ الَّتِي غَلَبَتْ كُلَّ شَيْ‏ءٍ وَ بِنُورِ وَجْهِكَ الَّذِي تَجَلَّيْتَ بِهِ لِلْجَبَلِ فَجَعَلْتَهُ دَكّا وَ خَرَّ مُوسَى صَعِقا، 9

وَ بِمَجْدِكَ الَّذِي ظَهَرَ عَلَى طُورِ سَيْنَاءَ فَكَلَّمْتَ بِهِ عَبْدَكَ وَ رَسُولَكَ مُوسَى بْنَ عِمْرَانَ وَ بِطَلْعَتِكَ فِي سَاعِيرَ وَ ظُهُورِكَ فِي جَبَلِ فَارَانَ بِرَبَوَاتِ الْمُقَدَّسِينَ وَ جُنُودِ الْمَلائِكَةِ الصَّافِّينَ وَ خُشُوعِ الْمَلائِكَةِ الْمُسَبِّحِينَ وَ بِبَرَكَاتِكَ الَّتِي بَارَكْتَ فِيهَا عَلَى إِبْرَاهِيمَ خَلِيلِكَ عَلَيْهِ السَّلامُ فِي أُمَّةِ مُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَ آلِهِ وَ بَارَكْتَ لِإِسْحَاقَ صَفِيِّكَ فِي أُمَّةِ عِيسَى عَلَيْهِمَا السَّلامُ وَ بَارَكْتَ لِيَعْقُوبَ إِسْرَائِيلِكَ فِي أُمَّةِ مُوسَى عَلَيْهِمَا السَّلامُ، 10
]]
local samat3 =[[
وَ بَارَكْتَ لِحَبِيبِكَ مُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَ آلِهِ فِي عِتْرَتِهِ وَ ذُرِّيَّتِهِ وَ [فِي‏] أُمَّتِهِ اللَّهُمَّ وَ كَمَا غِبْنَا عَنْ ذَلِكَ وَ لَمْ نَشْهَدْهُ وَ آمَنَّا بِهِ وَ لَمْ نَرَهُ صِدْقا وَ عَدْلا أَنْ تُصَلِّيَ عَلَى مُحَمَّدٍ وَ آلِ مُحَمَّدٍ وَ أَنْ تُبَارِكَ عَلَى مُحَمَّدٍ وَ آلِ مُحَمَّدٍ وَ تَرَحَّمَ عَلَى مُحَمَّدٍ وَ آلِ مُحَمَّدٍ كَأَفْضَلِ مَا صَلَّيْتَ وَ بَارَكْتَ وَ تَرَحَّمْتَ عَلَى إِبْرَاهِيمَ وَ آلِ إِبْرَاهِيمَ إِنَّكَ حَمِيدٌ مَجِيدٌ فَعَّالٌ لِمَا تُرِيدُ وَ أَنْتَ عَلَى كُلِّ شَيْ‏ءٍ قَدِيرٌ [شَهِيدٌ] 11

پس حاجت خود را ذكر مى ‏كنى و مى‏ گويى :
اللَّهُمَّ بِحَقِّ هَذَا الدُّعَاءِ وَ بِحَقِّ هَذِهِ الْأَسْمَاءِ الَّتِي لا يَعْلَمُ تَفْسِيرَهَا وَ لا يَعْلَمُ بَاطِنَهَا غَيْرُكَ صَلِّ عَلَى مُحَمَّدٍ وَ آلِ مُحَمَّدٍ وَ افْعَلْ بِي مَا أَنْتَ أَهْلُهُ وَ لا تَفْعَلْ بِي مَا أَنَا أَهْلُهُ وَ اغْفِرْ لِي مِنْ ذُنُوبِي مَا تَقَدَّمَ مِنْهَا وَ مَا تَأَخَّرَ وَ وَسِّعْ عَلَيَّ مِنْ حَلالِ رِزْقِكَ وَ اكْفِنِي مَئُونَةَ إِنْسَانِ سَوْءٍ وَ جَارِ سَوْءٍ وَ قَرِينِ سَوْءٍ وَ سُلْطَانِ سَوْءٍ إِنَّكَ عَلَى مَا تَشَاءُ قَدِيرٌ وَ بِكُلِّ شَيْ‏ءٍ عَلِيمٌ آمِينَ رَبَّ الْعَالَمِينَ 12

علاّمه مجلسى از كتاب«مصباح» سيّد ابن باقى نقل كرده كه بعد از دعاى سمات اين دعا را بخواند:
اللَّهُمَّ بِحَقِّ هَذَا الدُّعَاءِ وَ بِحَقِّ هَذِهِ الْأَسْمَاءِ الَّتِي لا يَعْلَمُ تَفْسِيرَهَا وَ لا تَأْوِيلَهَا وَ لا بَاطِنَهَا وَ لا ظَاهِرَهَا غَيْرُكَ أَنْ تُصَلِّيَ عَلَى مُحَمَّدٍ وَ آلِ مُحَمَّدٍ وَ أَنْ تَرْزُقَنِي خَيْرَ الدُّنْيَا وَ الْآخِرَةِ . 13

پس‏ حاجات خود را بخواهد و بگويد:
وَ افْعَلْ بِي مَا أَنْتَ أَهْلُهُ وَ لا تَفْعَلْ بِي مَا أَنَا أَهْلُهُ وَ انْتَقِمْ لِي مِنْ فُلانِ بْنِ فُلانٍ 14

و نام دشمن را بگويد،سپس بگويد:
وَ اغْفِرْ لِي مِنْ ذُنُوبِي مَا تَقَدَّمَ مِنْهَا وَ مَا تَأَخَّرَ وَ لِوَالِدَيَّ وَ لِجَمِيعِ الْمُؤْمِنِينَ وَ الْمُؤْمِنَاتِ وَ وَسِّعْ عَلَيَّ مِنْ حَلالِ رِزْقِكَ وَ اكْفِنِي مَئُونَةَ إِنْسَانِ سَوْءٍ وَ جَارِ سَوْءٍ وَ سُلْطَانِ سَوْءٍ وَ قَرِينِ سَوْءٍ وَ يَوْمِ سَوْءٍ وَ سَاعَةِ سَوْءٍ وَ انْتَقِمْ لِي مِمَّنْ يَكِيدُنِي وَ مِمَّنْ يَبْغِي عَلَيَّ وَ يُرِيدُ بِي وَ بِأَهْلِي وَ أَوْلادِي وَ إِخْوَانِي وَ جِيرَانِي وَ قَرَابَاتِي مِنَ الْمُؤْمِنِينَ وَ الْمُؤْمِنَاتِ ظُلْما إِنَّكَ عَلَى مَا تَشَاءُ قَدِيرٌ وَ بِكُلِّ شَيْ‏ءٍ عَلِيمٌ آمِينَ رَبَّ الْعَالَمِينَ . 15

بعد بگوید:
اللَّهُمَّ بِحَقِّ هَذَا الدُّعَاءِ تَفَضَّلْ عَلَى فُقَرَاءِ الْمُؤْمِنِينَ وَ الْمُؤْمِنَاتِ بِالْغِنَى وَ الثَّرْوَةِ وَ عَلَى مَرْضَى الْمُؤْمِنِينَ وَ الْمُؤْمِنَاتِ بِالشِّفَاءِ وَ الصِّحَّةِ وَ عَلَى أَحْيَاءِ الْمُؤْمِنِينَ وَ الْمُؤْمِنَاتِ بِاللُّطْفِ وَ الْكَرَامَةِ وَ عَلَى أَمْوَاتِ الْمُؤْمِنِينَ وَ الْمُؤْمِنَاتِ بِالْمَغْفِرَةِ وَ الرَّحْمَةِ وَ عَلَى مُسَافِرِي الْمُؤْمِنِينَ وَ الْمُؤْمِنَاتِ بِالرَّدِّ إِلَى أَوْطَانِهِمْ سَالِمِينَ غَانِمِينَ بِرَحْمَتِكَ يَا أَرْحَمَ الرَّاحِمِينَ وَ صَلَّى اللَّهُ عَلَى سَيِّدِنَا مُحَمَّدٍ خَاتَمِ النَّبِيِّينَ وَ عِتْرَتِهِ الطَّاهِرِينَ وَ سَلَّمَ تَسْلِيما كَثِيرا. 16

ابن فهد حلّى فرموده است:پس از دعاى سمات مستحب‏ است بگويى:
اللَّهُمَّ إِنِّي أَسْأَلُكَ بِحُرْمَةِ هَذَا الدُّعَاءِ وَ بِمَا فَاتَ مِنْهُ مِنَ الْأَسْمَاءِ وَ بِمَا يَشْتَمِلُ عَلَيْهِ مِنَ التَّفْسِيرِ وَ التَّدْبِيرِ الَّذِي لا يُحِيطُ بِهِ إِلا أَنْتَ أَنْ تَفْعَلَ بِي كَذَا وَ كَذَا 17

و به جاى(كذا و كذا)حاجت خود را بخواهد.

⇦التماس دعا➣ 🦋AxE🌹
]]
return tdbot.sendMessage(msg.to.id,0,1, samat1,1,'html') ,
tdbot.sendMessage(msg.to.id,0,1, samat2,1,'html') ,
tdbot.sendMessage(msg.to.id,0,1, samat3,1,'html')
end
if matches[1] == 'دعای ندبه' and is_mod(msg) or matches[1] == 'ندبه' and is_mod(msg) then
local nodbe1 =[[
🌺 دعای ندبه :

الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِینَ وَ صَلَّى اللَّهُ عَلَى سَیِّدِنَا مُحَمَّدٍ نَبِیِّهِ وَ آلِهِ وَ سَلَّمَ تَسْلِیما اللَّهُمَّ لَکَ الْحَمْدُ عَلَى مَا جَرَى بِهِ قَضَاؤُکَ فِی أَوْلِیَائِکَ الَّذِینَ اسْتَخْلَصْتَهُمْ لِنَفْسِکَ وَ دِینِکَ إِذِ اخْتَرْتَ لَهُمْ جَزِیلَ مَا عِنْدَکَ مِنَ النَّعِیمِ الْمُقِیمِ الَّذِی لا زَوَالَ لَهُ وَ لا اضْمِحْلالَ بَعْدَ أَنْ شَرَطْتَ عَلَیْهِمُ الزُّهْدَ فِی دَرَجَاتِ هَذِهِ الدُّنْیَا الدَّنِیَّهِ وَ زُخْرُفِهَا وَ زِبْرِجِهَا فَشَرَطُوا لَکَ ذَلِکَ وَ عَلِمْتَ مِنْهُمُ الْوَفَاءَ بِهِ فَقَبِلْتَهُمْ وَ قَرَّبْتَهُمْ وَ قَدَّمْتَ لَهُمُ الذِّکْرَ الْعَلِیَّ وَ الثَّنَاءَ الْجَلِیَا وَ أَهْبَطْتَ عَلَیْهِمْ مَلائِکَتَکَ وَ کَرَّمْتَهُمْ بِوَحْیِکَ وَ رَفَدْتَهُمْ بِعِلْمِکَ وَ جَعَلْتَهُمُ الذَّرِیعَهَ [الذَّرَائِعَ‏] إِلَیْکَ 

وَ الْوَسِیلَهَ إِلَى رِضْوَانِکَ فَبَعْضٌ أَسْکَنْتَهُ جَنَّتَکَ إِلَى أَنْ أَخْرَجْتَهُ مِنْهَا وَ بَعْضٌ حَمَلْتَهُ فِی فُلْکِکَ وَ نَجَّیْتَهُ وَ [مَعَ‏] مَنْ آمَنَ مَعَهُ مِنَ الْهَلَکَهِ بِرَحْمَتِکَ وَ بَعْضٌ اتَّخَذْتَهُ لِنَفْسِکَ خَلِیلا وَ سَأَلَکَ لِسَانَ صِدْقٍ فِی الْآخِرِینَ فَأَجَبْتَهُ وَ جَعَلْتَ ذَلِکَ عَلِیّا وَ بَعْضٌ کَلَّمْتَهُ مِنْ شَجَرَهٍ تَکْلِیما وَ جَعَلْتَ لَهُ مِنْ أَخِیهِ رِدْءا وَ وَزِیرا وَ بَعْضٌ أَوْلَدْتَهُ مِنْ غَیْرِ أَبٍ وَ آتَیْتَهُ الْبَیِّنَاتِ وَ أَیَّدْتَهُ بِرُوحِ الْقُدُسِ وَ کُلٌّ [وَ کُلا] شَرَعْتَ لَهُ شَرِیعَهً

وَ نَهَجْتَ لَهُ مِنْهَاجا وَ تَخَیَّرْتَ لَهُ أَوْصِیَاءَ [أَوْصِیَاءَهُ‏] مُسْتَحْفِظا بَعْدَ مُسْتَحْفِظٍ [مُسْتَحْفَظا بَعْدَ مُسْتَحْفَظٍ] مِنْ مُدَّهٍ إِلَى مُدَّهٍ إِقَامَهً لِدِینِکَ وَ حُجَّهً عَلَى عِبَادِکَ وَ لِئَلا یَزُولَ الْحَقُّ عَنْ مَقَرِّهِ وَ یَغْلِبَ الْبَاطِلُ عَلَى أَهْلِهِ وَ لا [لِئَلا] یَقُولَ أَحَدٌ لَوْ لا أَرْسَلْتَ إِلَیْنَا رَسُولا مُنْذِرا وَ أَقَمْتَ لَنَا عَلَما هَادِیا فَنَتَّبِعَ آیَاتِکَ مِنْ قَبْلِ أَنْ نَذِلَّ وَ نَخْزَى إِلَى أَنِ انْتَهَیْتَ بِالْأَمْرِ إِلَى حَبِیبِکَ وَ نَجِیبِکَ مُحَمَّدٍ صَلَّى اللَّهُ عَلَیْهِ وَ آلِهِ،

فَکَانَ کَمَا انْتَجَبْتَهُ سَیِّدَ مَنْ خَلَقْتَهُ وَ صَفْوَهَ مَنِ اصْطَفَیْتَهُ وَ أَفْضَلَ مَنِ اجْتَبَیْتَهُ وَ أَکْرَمَ مَنِ اعْتَمَدْتَهُ قَدَّمْتَهُ عَلَى أَنْبِیَائِکَ وَ بَعَثْتَهُ إِلَى الثَّقَلَیْنِ مِنْ عِبَادِکَ وَ أَوْطَأْتَهُ مَشَارِقَکَ وَ مَغَارِبَکَ وَ سَخَّرْتَ لَهُ الْبُرَاقَ وَ عَرَجْتَ بِرُوحِهِ [بِهِ‏] إِلَى سَمَائِکَ وَ أَوْدَعْتَهُ عِلْمَ مَا کَانَ وَ مَا یَکُونُ إِلَى انْقِضَاءِ خَلْقِکَ ثُمَّ نَصَرْتَهُ بِالرُّعْبِ وَ حَفَفْتَهُ بِجَبْرَئِیلَ وَ مِیکَائِیلَ وَ الْمُسَوِّمِینَ مِنْ مَلائِکَتِکَ وَ وَعَدْتَهُ أَنْ تُظْهِرَ دِینَهُ عَلَى الدِّینِ کُلِّهِ وَ لَوْ کَرِهَ الْمُشْرِکُونَ وَ ذَلِکَ بَعْدَ أَنْ بَوَّأْتَهُ مُبَوَّأَ صِدْقٍ مِنْ أَهْلِهِ وَ جَعَلْتَ لَهُ وَ لَهُمْ أَوَّلَ بَیْتٍ وُضِعَ لِلنَّاسِ ، 

لَلَّذِی بِبَکَّهَ مُبَارَکا وَ هُدًى لِلْعَالَمِینَ فِیهِ آیَاتٌ بَیِّنَاتٌ مَقَامُ إِبْرَاهِیمَ وَ مَنْ دَخَلَهُ کَانَ آمِنا وَ قُلْتَ إِنَّمَا یُرِیدُ اللَّهُ لِیُذْهِبَ عَنْکُمُ الرِّجْسَ أَهْلَ الْبَیْتِ وَ یُطَهِّرَکُمْ تَطْهِیرا ثُمَّ جَعَلْتَ أَجْرَ مُحَمَّدٍ صَلَوَاتُکَ عَلَیْهِ وَ آلِهِ مَوَدَّتَهُمْ فِی کِتَابِکَ فَقُلْتَ قُلْ لا أَسْئَلُکُمْ عَلَیْهِ أَجْرا إِلا الْمَوَدَّهَ فِی الْقُرْبَى وَ قُلْتَ مَا سَأَلْتُکُمْ مِنْ أَجْرٍ فَهُوَ لَکُمْ وَ قُلْتَ مَا أَسْئَلُکُمْ عَلَیْهِ مِنْ أَجْرٍ إِلا مَنْ شَاءَ أَنْ یَتَّخِذَ إِلَى رَبِّهِ سَبِیلا فَکَانُوا هُمُ السَّبِیلَ إِلَیْکَ ،

]]
local nodbe2 =[[
وَ الْمَسْلَکَ إِلَى رِضْوَانِکَ فَلَمَّا انْقَضَتْ أَیَّامُهُ أَقَامَ وَلِیَّهُ عَلِیَّ بْنَ أَبِی طَالِبٍ صَلَوَاتُکَ عَلَیْهِمَا وَ آلِهِمَا هَادِیا إِذْ کَانَ هُوَ الْمُنْذِرَ وَ لِکُلِّ قَوْمٍ هَادٍ فَقَالَ وَ الْمَلَأُ أَمَامَهُ مَنْ کُنْتُ مَوْلاهُ فَعَلِیٌّ مَوْلاهُ اللَّهُمَّ وَالِ مَنْ وَالاهُ وَ عَادِ مَنْ عَادَاهُ وَ انْصُرْ مَنْ نَصَرَهُ وَ اخْذُلْ مَنْ خَذَلَهُ وَ قَالَ مَنْ کُنْتُ أَنَا نَبِیَّهُ فَعَلِیٌّ أَمِیرُهُ وَ قَالَ أَنَا وَ عَلِیٌّ مِنْ شَجَرَهٍ وَاحِدَهٍ وَ سَائِرُ النَّاسِ مِنْ شَجَرٍ شَتَّى وَ أَحَلَّهُ مَحَلَّ هَارُونَ مِنْ مُوسَى فَقَالَ لَهُ أَنْتَ مِنِّی بِمَنْزِلَهِ هَارُونَ مِنْ مُوسَى إِلا أَنَّهُ لا نَبِیَّ بَعْدِی وَ زَوَّجَهُ ابْنَتَهُ سَیِّدَهَ نِسَاءِ الْعَالَمِینَ وَ أَحَلَّ لَهُ مِنْ مَسْجِدِهِ مَا حَلَّ لَهُ وَ سَدَّ الْأَبْوَابَ إِلا بَابَهُ ثُمَّ أَوْدَعَهُ عِلْمَهُ وَ حِکْمَتَهُ فَقَالَ: 

أَنَا مَدِینَهُ الْعِلْمِ وَ عَلِیٌّ بَابُهَا فَمَنْ أَرَادَ الْمَدِینَهَ وَ الْحِکْمَهَ فَلْیَأْتِهَا مِنْ بَابِهَا ثُمَّ قَالَ أَنْتَ أَخِی وَ وَصِیِّی وَ وَارِثِی لَحْمُکَ مِنْ لَحْمِی وَ دَمُکَ مِنْ دَمِی وَ سِلْمُکَ سِلْمِی وَ حَرْبُکَ حَرْبِی وَ الْإِیمَانُ مُخَالِطٌ لَحْمَکَ وَ دَمَکَ کَمَا خَالَطَ لَحْمِی وَ دَمِی وَ أَنْتَ غَدا عَلَى الْحَوْضِ خَلِیفَتِی وَ أَنْتَ تَقْضِی دَیْنِی وَ تُنْجِزُ عِدَاتِی وَ شِیعَتُکَ عَلَى مَنَابِرَ مِنْ نُورٍ مُبْیَضَّهً وُجُوهُهُمْ حَوْلِی فِی الْجَنَّهِ وَ هُمْ جِیرَانِی وَ لَوْ لا أَنْتَ یَا عَلِیُّ لَمْ یُعْرَفِ الْمُؤْمِنُونَ بَعْدِی وَ کَانَ بَعْدَهُ هُدًى مِنَ الضَّلالِ وَ نُورا مِنَ الْعَمَى وَ حَبْلَ اللَّهِ الْمَتِینَ وَ صِرَاطَهُ الْمُسْتَقِیمَ، 

لا یُسْبَقُ بِقَرَابَهٍ فِی رَحِمٍ وَ لا بِسَابِقَهٍ فِی دِینٍ وَ لا یُلْحَقُ فِی مَنْقَبَهٍ مِنْ مَنَاقِبِهِ یَحْذُو حَذْوَ الرَّسُولِ صَلَّى اللَّهُ عَلَیْهِمَا وَ آلِهِمَا وَ یُقَاتِلُ عَلَى التَّأْوِیلِ وَ لا تَأْخُذُهُ فِی اللَّهِ لَوْمَهُ لائِمٍ قَدْ وَتَرَ فِیهِ صَنَادِیدَ الْعَرَبِ وَ قَتَلَ أَبْطَالَهُمْ وَ نَاوَشَ [نَاهَشَ‏] ذُؤْبَانَهُمْ فَأَوْدَعَ قُلُوبَهُمْ أَحْقَادا بَدْرِیَّهً وَ خَیْبَرِیَّهً وَ حُنَیْنِیَّهً وَ غَیْرَهُنَّ فَأَضَبَّتْ [فَأَصَنَّتْ‏] [فَأَصَنَ‏] عَلَى عَدَاوَتِهِ وَ أَکَبَّتْ عَلَى مُنَابَذَتِهِ حَتَّى قَتَلَ النَّاکِثِینَ وَ الْقَاسِطِینَ وَ الْمَارِقِینَ وَ لَمَّا قَضَى نَحْبَهُ وَ قَتَلَهُ أَشْقَى [الْأَشْقِیَاءِ مِنَ الْأَوَّلِینَ وَ الْآخِرِینَ‏] الْآخِرِینَ یَتْبَعُ أَشْقَى الْأَوَّلِینَ لَمْ یُمْتَثَلْ أَمْرُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَیْهِ وَ آلِهِ فِی الْهَادِینَ بَعْدَ الْهَادِینَ وَ الْأُمَّهُ مُصِرَّهٌ عَلَى مَقْتِهِ مُجْتَمِعَهٌ عَلَى قَطِیعَهِ رَحِمِهِ وَ إِقْصَاءِ وَلَدِهِ إِلا الْقَلِیلَ مِمَّنْ وَفَى لِرِعَایَهِ الْحَقِّ فِیهِمْ ، 

فَقُتِلَ مَنْ قُتِلَ وَ سُبِیَ مَنْ سُبِیَ وَ أُقْصِیَ مَنْ أُقْصِیَ وَ جَرَى الْقَضَاءُ لَهُمْ بِمَا یُرْجَى لَهُ حُسْنُ الْمَثُوبَهِ إِذْ کَانَتِ الْأَرْضُ لِلَّهِ یُورِثُهَا مَنْ یَشَاءُ مِنْ عِبَادِهِ وَ الْعَاقِبَهُ لِلْمُتَّقِینَ وَ سُبْحَانَ رَبِّنَا إِنْ کَانَ وَعْدُ رَبِّنَا لَمَفْعُولا وَ لَنْ یُخْلِفَ اللَّهُ وَعْدَهُ وَ هُوَ الْعَزِیزُ الْحَکِیمُ فَعَلَى الْأَطَائِبِ مِنْ أَهْلِ بَیْتِ مُحَمَّدٍ وَ عَلِیٍّ صَلَّى اللَّهُ عَلَیْهِمَا وَ آلِهِمَا فَلْیَبْکِ الْبَاکُونَ وَ إِیَّاهُمْ فَلْیَنْدُبِ النَّادِبُونَ وَ لِمِثْلِهِمْ فَلْتُذْرَفِ [فَلْتَدُرَّ] الدُّمُوعُ وَ لْیَصْرُخِ الصَّارِخُونَ وَ یَضِجُّ [یَضِجَ‏] الضَّاجُّونَ وَ یَعِجُّ [یَعِجَ‏] الْعَاجُّونَ أَیْنَ الْحَسَنُ أَیْنَ الْحُسَیْنُ أَیْنَ أَبْنَاءُ الْحُسَیْنِ صَالِحٌ بَعْدَ صَالِحٍ وَ صَادِقٌ بَعْدَ صَادِقٍ أَیْنَ السَّبِیلُ بَعْدَ السَّبِیلِ ، 

أَیْنَ الْخِیَرَهُ بَعْدَ الْخِیَرَهِ أَیْنَ الشُّمُوسُ الطَّالِعَهُ أَیْنَ الْأَقْمَارُ الْمُنِیرَهُ أَیْنَ الْأَنْجُمُ الزَّاهِرَهُ أَیْنَ أَعْلامُ الدِّینِ وَ قَوَاعِدُ الْعِلْمِ أَیْنَ بَقِیَّهُ اللَّهِ الَّتِی لا تَخْلُو مِنَ الْعِتْرَهِ الْهَادِیَهِ أَیْنَ الْمُعَدُّ لِقَطْعِ دَابِرِ الظَّلَمَهِ أَیْنَ الْمُنْتَظَرُ لِإِقَامَهِ الْأَمْتِ وَ الْعِوَجِ أَیْنَ الْمُرْتَجَى لِإِزَالَهِ الْجَوْرِ وَ الْعُدْوَانِ أَیْنَ الْمُدَّخَرُ لِتَجْدِیدِ الْفَرَائِضِ وَ السُّنَنِ أَیْنَ ]]
local nodbe3 =[[
الْمُتَخَیَّرُ [الْمُتَّخَذُ] لِإِعَادَهِ الْمِلَّهِ وَ الشَّرِیعَهِ أَیْنَ الْمُؤَمَّلُ لِإِحْیَاءِ الْکِتَابِ وَ حُدُودِهِ أَیْنَ مُحْیِی مَعَالِمِ الدِّینِ وَ أَهْلِهِ أَیْنَ قَاصِمُ شَوْکَهِ الْمُعْتَدِینَ أَیْنَ هَادِمُ أَبْنِیَهِ الشِّرْکِ وَ النِّفَاقِ أَیْنَ مُبِیدُ أَهْلِ الْفُسُوقِ وَ الْعِصْیَانِ وَ الطُّغْیَانِ أَیْنَ حَاصِدُ فُرُوعِ الْغَیِّ وَ الشِّقَاقِ [النِّفَاقِ‏]، 

أَیْنَ طَامِسُ آثَارِ الزَّیْغِ وَ الْأَهْوَاءِ أَیْنَ قَاطِعُ حَبَائِلِ الْکِذْبِ [الْکَذِبِ‏] وَ الافْتِرَاءِ أَیْنَ مُبِیدُ الْعُتَاهِ وَ الْمَرَدَهِ أَیْنَ مُسْتَأْصِلُ أَهْلِ الْعِنَادِ وَ التَّضْلِیلِ وَ الْإِلْحَادِ أَیْنَ مُعِزُّ الْأَوْلِیَاءِ وَ مُذِلُّ الْأَعْدَاءِ أَیْنَ جَامِعُ الْکَلِمَهِ [الْکَلِمِ‏] عَلَى التَّقْوَى أَیْنَ بَابُ اللَّهِ الَّذِی مِنْهُ یُؤْتَى أَیْنَ وَجْهُ اللَّهِ الَّذِی إِلَیْهِ یَتَوَجَّهُ الْأَوْلِیَاءُ أَیْنَ السَّبَبُ الْمُتَّصِلُ بَیْنَ الْأَرْضِ وَ السَّمَاءِ أَیْنَ صَاحِبُ یَوْمِ الْفَتْحِ وَ نَاشِرُ رَایَهِ الْهُدَى أَیْنَ مُؤَلِّفُ شَمْلِ الصَّلاحِ وَ الرِّضَا، 

أَیْنَ الطَّالِبُ بِذُحُولِ الْأَنْبِیَاءِ وَ أَبْنَاءِ الْأَنْبِیَاءِ أَیْنَ الطَّالِبُ [الْمُطَالِبُ‏] بِدَمِ الْمَقْتُولِ بِکَرْبَلاءَ أَیْنَ الْمَنْصُورُ عَلَى مَنِ اعْتَدَى عَلَیْهِ وَ افْتَرَى أَیْنَ الْمُضْطَرُّ الَّذِی یُجَابُ إِذَا دَعَا أَیْنَ صَدْرُ الْخَلائِقِ [الْخَلائِفِ‏] ذُو الْبِرِّ وَ التَّقْوَى أَیْنَ ابْنُ النَّبِیِّ الْمُصْطَفَى وَ ابْنُ عَلِیٍّ الْمُرْتَضَى وَ ابْنُ خَدِیجَهَ الْغَرَّاءِ وَ ابْنُ فَاطِمَهَ الْکُبْرَى بِأَبِی أَنْتَ وَ أُمِّی وَ نَفْسِی لَکَ الْوِقَاءُ وَ الْحِمَى یَا ابْنَ السَّادَهِ الْمُقَرَّبِینَ یَا ابْنَ النُّجَبَاءِ الْأَکْرَمِینَ یَا ابْنَ الْهُدَاهِ الْمَهْدِیِّینَ [الْمُهْتَدِینَ‏] یَا ابْنَ الْخِیَرَهِ الْمُهَذَّبِینَ یَا ابْنَ الْغَطَارِفَهِ الْأَنْجَبِینَ یَا ابْنَ الْأَطَائبِ الْمُطَهَّرِینَ [الْمُسْتَظْهَرِینَ‏] یَا ابْنَ الْخَضَارِمَهِ الْمُنْتَجَبِینَ یَا ابْنَ الْقَمَاقِمَهِ الْأَکْرَمِینَ [الْأَکْبَرِینَ‏] یَا ابْنَ الْبُدُورِ الْمُنِیرَهِ یَا ابْنَ السُّرُجِ الْمُضِیئَهِ یَا ابْنَ الشُّهُبِ الثَّاقِبَهِ یَا ابْنَ الْأَنْجُمِ الزَّاهِرَهِ، 

یَا ابْنَ السُّبُلِ الْوَاضِحَهِ یَا ابْنَ الْأَعْلامِ اللائِحَهِ یَا ابْنَ الْعُلُومِ الْکَامِلَهِ یَا ابْنَ السُّنَنِ الْمَشْهُورَهِ یَا ابْنَ الْمَعَالِمِ الْمَأْثُورَهِ یَا ابْنَ الْمُعْجِزَاتِ الْمَوْجُودَهِ یَا ابْنَ الدَّلائِلِ الْمَشْهُودَهِ [الْمَشْهُورَهِ] یَا ابْنَ الصِّرَاطِ الْمُسْتَقِیمِ یَا ابْنَ النَّبَإِ الْعَظِیمِ یَا ابْنَ مَنْ هُوَ فِی أُمِّ الْکِتَابِ لَدَى اللَّهِ عَلِیٌّ حَکِیمٌ یَا ابْنَ الْآیَاتِ وَ الْبَیِّنَاتِ یَا ابْنَ الدَّلائِلِ الظَّاهِرَاتِ یَا ابْنَ الْبَرَاهِینِ الْوَاضِحَاتِ الْبَاهِرَاتِ یَا ابْنَ الْحُجَجِ الْبَالِغَاتِ یَا ابْنَ النِّعَمِ السَّابِغَاتِ یَا ابْنَ طه وَ الْمُحْکَمَاتِ، 

یَا ابْنَ یس وَ الذَّارِیَاتِ یَا ابْنَ الطُّورِ وَ الْعَادِیَاتِ یَا ابْنَ مَنْ دَنَا فَتَدَلَّى فَکَانَ قَابَ قَوْسَیْنِ أَوْ أَدْنَى دُنُوّا وَ اقْتِرَابا مِنَ الْعَلِیِّ الْأَعْلَى لَیْتَ شِعْرِی أَیْنَ اسْتَقَرَّتْ بِکَ النَّوَى بَلْ أَیُّ أَرْضٍ تُقِلُّکَ أَوْ ثَرَى أَ بِرَضْوَى أَوْ غَیْرِهَا أَمْ ذِی طُوًى عَزِیزٌ عَلَیَّ أَنْ أَرَى الْخَلْقَ وَ لا تُرَى وَ لا أَسْمَعَ [أَسْمَعُ‏] لَکَ حَسِیسا وَ لا نَجْوَى عَزِیزٌ عَلَیَّ أَنْ تُحِیطَ بِکَ دُونِیَ [لا تُحِیطَ بِی دُونَکَ‏] الْبَلْوَى وَ لا یَنَالَکَ مِنِّی ضَجِیجٌ وَ لا شَکْوَى بِنَفْسِی أَنْتَ مِنْ مُغَیَّبٍ لَمْ یَخْلُ مِنَّا بِنَفْسِی أَنْتَ مِنْ نَازِحٍ مَا نَزَحَ [یَنْزَحُ‏] عَنَّا بِنَفْسِی أَنْتَ أُمْنِیَّهُ شَائِقٍ یَتَمَنَّى مِنْ مُؤْمِنٍ وَ مُؤْمِنَهٍ ذَکَرَا فَحَنَّا بِنَفْسِی أَنْتَ مِنْ عَقِیدِ عِزٍّ لا یُسَامَى، 

بِنَفْسِی أَنْتَ مِنْ أَثِیلِ مَجْدٍ لا یُجَارَى [یُحَاذَى‏] بِنَفْسِی أَنْتَ مِنْ تِلادِ نِعَمٍ لا تُضَاهَى بِنَفْسِی أَنْتَ مِنْ نَصِیفِ شَرَفٍ لا یُسَاوَى إِلَى مَتَى أَحَارُ [أَجْأَرُ] فِیکَ یَا مَوْلایَ وَ إِلَى مَتَى وَ أَیَّ خِطَابٍ أَصِفُ فِیکَ وَ أَیَّ نَجْوَى عَزِیزٌ عَلَیَّ أَنْ أُجَابَ دُونَکَ وَ [أَوْ] أُنَاغَى عَزِیزٌ عَلَیَّ أَنْ أَبْکِیَکَ وَ یَخْذُلَکَ الْوَرَى عَزِیزٌ عَلَیَّ أَنْ یَجْرِیَ عَلَیْکَ دُونَهُمْ مَا جَرَى هَلْ مِنْ مُعِینٍ فَأُطِیلَ مَعَهُ الْعَوِیلَ وَ الْبُکَاءَ هَلْ مِنْ جَزُوعٍ فَأُسَاعِدَ جَزَعَهُ إِذَا خَلا هَلْ قَذِیَتْ عَیْنٌ فَسَاعَدَتْهَا عَیْنِی عَلَى الْقَذَى ، 

]]
local nodbe4 =[[
هَلْ إِلَیْکَ یَا ابْنَ أَحْمَدَ سَبِیلٌ فَتُلْقَى هَلْ یَتَّصِلُ یَوْمُنَا مِنْکَ بِعِدَهٍ [بِغَدِهِ‏] فَنَحْظَى مَتَى نَرِدُ مَنَاهِلَکَ الرَّوِیَّهَ فَنَرْوَى مَتَى نَنْتَقِعُ مِنْ عَذْبِ مَائِکَ فَقَدْ طَالَ الصَّدَى مَتَى نُغَادِیکَ وَ نُرَاوِحُکَ فَنَقِرَّ عَیْنا [فَتَقَرَّ عُیُونُنَا] مَتَى تَرَانَا [وَ] نَرَاکَ وَ قَدْ نَشَرْتَ لِوَاءَ النَّصْرِ تُرَى أَ تَرَانَا نَحُفُّ بِکَ وَ أَنْتَ تَؤُمُّ الْمَلَأَ وَ قَدْ مَلَأْتَ الْأَرْضَ عَدْلا وَ أَذَقْتَ أَعْدَاءَکَ هَوَانا وَ عِقَابا وَ أَبَرْتَ الْعُتَاهَ وَ جَحَدَهَ الْحَقِّ وَ قَطَعْتَ دَابِرَ الْمُتَکَبِّرِینَ وَ اجْتَثَثْتَ أُصُولَ الظَّالِمِینَ، 

وَ نَحْنُ نَقُولُ الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِینَ اللَّهُمَّ أَنْتَ کَشَّافُ الْکُرَبِ وَ الْبَلْوَى وَ إِلَیْکَ أَسْتَعْدِی فَعِنْدَکَ الْعَدْوَى وَ أَنْتَ رَبُّ الْآخِرَهِ وَ الدُّنْیَا [الْأُولَى‏] فَأَغِثْ یَا غِیَاثَ الْمُسْتَغِیثِینَ عُبَیْدَکَ الْمُبْتَلَى وَ أَرِهِ سَیِّدَهُ یَا شَدِیدَ الْقُوَى وَ أَزِلْ عَنْهُ بِهِ الْأَسَى وَ الْجَوَى وَ بَرِّدْ غَلِیلَهُ یَا مَنْ عَلَى الْعَرْشِ اسْتَوَى وَ مَنْ إِلَیْهِ الرُّجْعَى وَ الْمُنْتَهَى اللَّهُمَّ وَ نَحْنُ عَبِیدُکَ التَّائِقُونَ [الشَّائِقُونَ‏] إِلَى وَلِیِّکَ الْمُذَکِّرِ بِکَ وَ بِنَبِیِّکَ خَلَقْتَهُ لَنَا عِصْمَهً وَ مَلاذا وَ أَقَمْتَهُ لَنَا قِوَاما وَ مَعَاذا وَ جَعَلْتَهُ لِلْمُؤْمِنِینَ مِنَّا إِمَاما فَبَلِّغْهُ مِنَّا تَحِیَّهً وَ سَلاما، 

وَ زِدْنَا بِذَلِکَ یَا رَبِّ إِکْرَاما وَ اجْعَلْ مُسْتَقَرَّهُ لَنَا مُسْتَقَرّا وَ مُقَاما وَ أَتْمِمْ نِعْمَتَکَ بِتَقْدِیمِکَ إِیَّاهُ أَمَامَنَا حَتَّى تُورِدَنَا جِنَانَکَ [جَنَّاتِکَ‏] وَ مُرَافَقَهَ الشُّهَدَاءِ مِنْ خُلَصَائِکَ اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَ آلِ مُحَمَّدٍ وَ صَلِّ عَلَى مُحَمَّدٍ جَدِّهِ [وَ] رَسُولِکَ السَّیِّدِ الْأَکْبَرِ وَ عَلَى [عَلِیٍ‏] أَبِیهِ السَّیِّدِ الْأَصْغَرِ وَ جَدَّتِهِ الصِّدِّیقَهِ الْکُبْرَى فَاطِمَهَ بِنْتِ مُحَمَّدٍ وَ عَلَى مَنِ اصْطَفَیْتَ مِنْ آبَائِهِ الْبَرَرَهِ وَ عَلَیْهِ أَفْضَلَ وَ أَکْمَلَ وَ أَتَمَّ وَ أَدْوَمَ وَ أَکْثَرَ وَ أَوْفَرَ مَا صَلَّیْتَ عَلَى أَحَدٍ مِنْ أَصْفِیَائِکَ وَ خِیَرَتِکَ مِنْ خَلْقِکَ ، 

وَ صَلِّ عَلَیْهِ صَلاهً لا غَایَهَ لِعَدَدِهَا وَ لا نِهَایَهَ لِمَدَدِهَا وَ لا نَفَادَ لِأَمَدِهَا اللَّهُمَّ وَ أَقِمْ بِهِ الْحَقَّ وَ أَدْحِضْ بِهِ الْبَاطِلَ وَ أَدِلْ بِهِ أَوْلِیَاءَکَ وَ أَذْلِلْ بِهِ أَعْدَاءَکَ وَ صِلِ اللَّهُمَّ بَیْنَنَا وَ بَیْنَهُ وُصْلَهً تُؤَدِّی إِلَى مُرَافَقَهِ سَلَفِهِ وَ اجْعَلْنَا مِمَّنْ یَأْخُذُ بِحُجْزَتِهِمْ وَ یَمْکُثُ فِی ظِلِّهِمْ وَ أَعِنَّا عَلَى تَأْدِیَهِ حُقُوقِهِ إِلَیْهِ وَ الاجْتِهَادِ فِی طَاعَتِهِ وَ اجْتِنَابِ مَعْصِیَتِهِ وَ امْنُنْ عَلَیْنَا بِرِضَاهُ وَ هَبْ لَنَا رَأْفَتَهُ وَ رَحْمَتَهُ وَ دُعَاءَهُ وَ خَیْرَهُ مَا نَنَالُ بِهِ سَعَهً مِنْ رَحْمَتِکَ وَ فَوْزا عِنْدَکَ وَ اجْعَلْ صَلاتَنَا بِهِ مَقْبُولَهً وَ ذُنُوبَنَا بِهِ مَغْفُورَهً ، 

وَ دُعَاءَنَا بِهِ مُسْتَجَابا وَ اجْعَلْ أَرْزَاقَنَا بِهِ مَبْسُوطَهً وَ هُمُومَنَا بِهِ مَکْفِیَّهً وَ حَوَائِجَنَا بِهِ مَقْضِیَّهً وَ أَقْبِلْ إِلَیْنَا بِوَجْهِکَ الْکَرِیمِ وَ اقْبَلْ تَقَرُّبَنَا إِلَیْکَ وَ انْظُرْ إِلَیْنَا نَظْرَهً رَحِیمَهً نَسْتَکْمِلْ بِهَا الْکَرَامَهَ عِنْدَکَ ثُمَّ لا تَصْرِفْهَا عَنَّا بِجُودِکَ وَ اسْقِنَا مِنْ حَوْضِ جَدِّهِ صَلَّى اللَّهُ عَلَیْهِ وَ آلِهِ بِکَأْسِهِ وَ بِیَدِهِ رَیّا رَوِیّا هَنِیئا سَائِغا لا ظَمَأَ بَعْدَهُ یَا أَرْحَمَ الرَّاحِمِینَ 

آن گاه به صورتى كه گذشت نماز زیارت بجا مى‏آورى و به آن چه خواهى دعا مى‏كنى،كه ان شاء اللّه به اجابت خواهد رسید.

⇦التماس دعا➣ 🦋AxE🌹
]]
return tdbot.sendMessage(msg.to.id , 0, 1, nodbe1 ,1 ,'html') ,
tdbot.sendMessage(msg.to.id,0,1, nodbe2,1,'html') ,
tdbot.sendMessage(msg.to.id,0,1, nodbe3,1,'html') ,
tdbot.sendMessage(msg.to.id,0,1, nodbe4,1,'html')
end
end

return {
patterns = {
"^([Dd]oa list)$",
"^(لیست دعا)$",
"^(زیارت عاشورا)$",
"^(عاشورا)$",
"^(آیت الکرسی)$",
"^(ایت الکرسی)$",
"^(دعای توسل)$",
"^(توسل)$",
"^(دعای کمیل)$",
"^(کمیل)$",
"^(دعای عهد)$",
"^(عهد)$",
"^(دعای فرج)$",
"^(دعای سمات)$",
"^(سمات)$",
"^(دعای ندبه)$",
"^(ندبه)$",
},
run = run,
}
